[
  {
    "id": 1,
    "title": "Inside Nuggets’ ‘cold war’ that led to firing both Michael Malone, Calvin Booth",
    "slug": "inside-nuggets-cold-war-that-led-to-firing-both-michael-malone-calvin-booth",
    "content": "In a shocking turn of events, the Denver Nuggets have parted ways with coach Michael Malone and general manager Calvin Booth due to a \"cold war\" that involved them competing in a series of heated staring contests and who could eat the most free nachos in the arena's cafeteria. Sources close to the team report that Malone's refusal to play young players, such as Jalen Pickett, in favor of Russell Westbrook was the final straw in this epic battle of wills. Apparently, Booth had drafted Pickett specifically to counter Malone's nacho-eating abilities, but it was too little, too late.\n\nAs tensions escalated, the team's defense began to resemble a kindergarten playground, with players arguing over who got to be \"it\" during tag breaks. In the end, the Nuggets decided both Malone and Booth had to go, as neither could out-nacho the other. David Adelman, the new interim coach, has vowed to resolve the nacho crisis and bring harmony back to the team. Meanwhile, Nikola Jokić remains optimistic, saying, \"Even without our coach and GM, we can still manage to lose games spectacularly.\"",
    "category": "Sports",
    "created_at": "2025-04-10T22:47:24.057737",
    "source": "https://news.google.com/rss/articles/CBMingFBVV95cUxPMWFpdWw2M2VLWWIzbzZGNzZONGdyTFRjbTc0RHo2OU9iZ25wNmRCaHZ1QU03OWN2MUZPdVg1NmFRMFR1WlkzNlNJb2xFbjZSNDMtYnpTSFloREFQWDJhVkxqV1k1NDRFazNkMGxCUmpiTmswZjVqSm5pd19EQXBwN0k1OUlIVzIxMnphZUs4TzdGNXpEVTFQaXQ1YnJpdw?oc=5",
    "image": "/static/images/inside-nuggets-cold-war-that-led-to-firing-both-michael-malone-calvin-booth.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a twist more shocking than your grandma's secret salsa recipe, the Nuggets axed both Malone and Booth in a move that made the Red Wedding look like a tea party!"
  },
  {
    "id": 2,
    "title": "Medicare Bleeds Billions on Pricey Bandages, and Doctors Get a Cut",
    "slug": "medicare-bleeds-billions-on-pricey-bandages-and-doctors-get-a-cut",
    "content": "Medicare has apparently decided to take the phrase \"bandaging the problem\" to a whole new level by hemorrhaging billions on luxury bandages and giving doctors a hefty kickback for each stylish wrap job. It turns out that the stylish bandages, complete with glitter and aromatherapy infusion, cost a whopping $100 per square inch. Meanwhile, doctors are raking it in by collecting a bonus for each patient they manage to swaddle in these designer bandages. The latest trend involves using these bandages as a form of medical couture, where patients are dressed in elaborate patterns to turn their wounds into Instagram-worthy artworks. Medicare officials argue that it's all worth it because nothing says \"quality healthcare\" like a well-dressed wound.",
    "category": "Health",
    "created_at": "2025-04-10T17:30:05.119777",
    "source": "https://news.google.com/rss/articles/CBMihAFBVV95cUxPdnlCaWFEcHRuNkhlUVRJS3AwTjlvSjgxQ3BGb3pjaXVKU1hVVGVYR3I0VjVjZFhzbnhvdllpMVZXaEVfQk1EZGxWZTdFR0hoMG9iMEY0Rl85YVJ1SzhYdmF6Vkwyd05pTW5KOWVrZVZldWR3dV9zWFgwQlV1UWJXMmV6Skg?oc=5",
    "image": "/static/images/medicare-bleeds-billions-on-pricey-bandages-and-doctors-get-a-cut.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a plot twist worthy of a bad daytime soap, Medicare now spends more on band-aids than Hollywood does on botox, with surgeons swapping their scalpels for scissors to literally 'cut' into"
  },
  {
    "id": 7,
    "title": "Neutrinos Are Shrinking, and That’s a Good Thing for Physics",
    "slug": "neutrinos-are-shrinking-and-that-s-a-good-thing-for-physics",
    "content": "In a groundbreaking development, scientists have discovered that neutrinos are shrinking at an alarming rate, which is somehow a wonderful thing for physics. Apparently, smaller neutrinos mean physicists can finally fit them in their pockets, making fieldwork a lot more manageable. The reduction in size is linked to their infamous ability to switch identities mid-flight, known as neutrino oscillations. This phenomenon now allows them to easily navigate through tight spaces, like dodging molecules in a game of cosmic dodgeball. As the neutrinos shrink, their interactions with matter become even more elusive, which could potentially reveal new dimensions where neutrinos might be sipping tiny lattes, plotting their next identity swap. While the universe remains puzzled by this development, physicists are rejoicing over the potential for new research opportunities and better neutrino-themed lunchboxes. Who knew that if neutrinos are tiny enough, physics might just become the coolest field in town?",
    "category": "Science",
    "created_at": "2025-04-10T23:49:12.464975",
    "source": "https://news.google.com/rss/articles/CBMiekFVX3lxTFBNYmZLa3l3UTZSWUJ0YjRWXzJBeVcwS2lpQjRQNnEyXzdYYzFiT2txWFB2SjlfRzZEUjdqdlhxYUNXVzNKU0dMWTk3LTVFbFl2YWczaTg5QlBEYmtEekhDUE5XSlItcjI2V01ROFpXcUYyWFB0Ync4Sjl3?oc=5",
    "image": "/static/images/neutrinos-are-shrinking-and-that-s-a-good-thing-for-physics.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a fashion-forward twist, subatomic neutrinos are slendering down, liberating physics from the tyranny of oversized particles!"
  },
  {
    "id": 8,
    "title": "U.S. and China Headed for ‘Monumental’ Split, Putting World Economy on Edge",
    "slug": "u-s-and-china-headed-for-monumental-split-putting-world-economy-on-edge",
    "content": "In a shocking and entirely predictable move, the U.S. and China are reportedly on the verge of a \"monumental\" split that will either send the world economy into chaos or just make it slightly more annoying to order Chinese food on Sundays. The impending separation is expected to spark a global trade apocalypse, where everything from Apple watches to cheap novelty socks will skyrocket in price, forcing the average consumer to choose between their gadgets and their dignity.\n\nAs tensions rise, China is threatening to withhold all exports of General Tso's chicken and fortune cookies, while the U.S. is retaliating by imposing tariffs on all imported pandas. Economists predict that if the split occurs, the global economy will be so badly damaged that people might actually have to start making their own takeout at home, a thought so terrifying that world leaders are scrambling to negotiate a last-minute reconciliation.",
    "category": "World",
    "created_at": "2025-04-11T05:58:31.072907",
    "source": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPV0tpaC1FSnRoZmt4dEh2RERlUDZCbk5xYlNyNmh5RzZva3dvNHc4MFdKcjlQbE8yMm5WZXBkZm13Y1d1WU15ZnEtUGdPb1p5czZoSFZZRDRXeERpUFNiZkRHZWtNUVRDUDN5LTZKNUo3X2VXVE9EVXdJbW5jSF9sdA?oc=5",
    "image": "/static/images/u-s-and-china-headed-for-monumental-split-putting-world-economy-on-edge.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a twist as ludicrous as a real housewife's new lips, the U.S. and China are puffing up their economic cheeks for an estrangement that threatens to put the global economy on the"
  },
  {
    "id": 9,
    "title": "CEO says he will be out of business by the end of the year if Trump tariffs come to fruition",
    "slug": "ceo-says-he-will-be-out-of-business-by-the-end-of-the-year-if-trump-tariffs-come-to-fruition",
    "content": "A CEO known for his notoriously bold predictions has declared that if Trump’s tariffs come to fruition, he’ll be out of business faster than you can say, \"Make America Great Again.\" Yes, this fearless leader of his small enterprise has bravely proclaimed that by December 31, he’ll either be “engulfed in a financial apocalypse or selling my prized collection of novelty pens on eBay.”\n\nIn a press conference where he wore a clown wig and oversized glasses for dramatic effect, he lamented how tariffs have become the adult version of “hot potato,” but with his business stuck in the burning lava of impending doom. “I’ll be liquidating my assets faster than you can say ‘dogecoin to the moon,’ and let me tell you, that’s saying something,” he added, clearly underestimating the gravity of the situation while simultaneously inviting people to bid on his memorabilia.\n\nAs he peered into the uncertain future, surrounded by charts depicting downward spirals and question marks, he urged his fellow CEOs to “strap in for the ride” or consider starting a “business in the lucrative field of homemade soap” instead, just in case. Because if the tariffs go through, his options will likely boil down to craft fairs and interpretive dance. Stay tuned for updates from his upcoming soap-making workshop!",
    "category": "Business",
    "created_at": "2025-04-11T11:58:34.501403",
    "source": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNRnJDU2pHQk5GYjd5Z2doWVdZTnVGM0tkSGxBLXU0djNOc0ozcnRldUpOelJNd1RqaVlrMDVRSGh2QzZLSTRDSUdNWTg0cHhKbG9abGJ1SmZuWVh0YzRkQ211NXRhZHZYeUVrbHRwVnJobG5hTHhKT09URzg0VUVNT2xJWU5BZ2k5OTl3OURqcmZpTDlNOC1oQTNFRDJNeWxhM19WVUlsZTFMQmtjRmw5Qk1R?oc=5",
    "image": "/static/images/ceo-says-he-will-be-out-of-business-by-the-end-of-the-year-if-trump-tariffs-come-to-fruition.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a shock to absolutely no one, local billionaire CEO suddenly realizes he won't be able to fill his Scrooge McDuck-style money pool if Trump's tariffs kick in; candidly admits that"
  },
  {
    "id": 10,
    "title": "Experts Doubt Kennedy’s Timetable for Finding the Cause of Autism",
    "slug": "experts-doubt-kennedy-s-timetable-for-finding-the-cause-of-autism",
    "content": "Robert F. Kennedy Jr. has announced an ambitious plan to solve the mystery of autism by September, which has left experts baffled and wondering if he’s secretly running a science fair project on a massive scale. Despite decades of research and a scientific consensus that vaccines are not the culprit, Kennedy's \"Make America Healthy Again\" initiative will valiantly plow through the evidence once more. Meanwhile, experts are still scratching their heads trying to figure out how Kennedy plans to wrap up this complex mystery before the summer ends, especially considering that even the most optimistic researchers would need a time machine or a crystal ball to meet such a deadline. \n\nIn a surprising twist, it's rumored that the real secret to uncovering the cause of autism involves a team of highly trained detectives searching for clues hidden in ancient hieroglyphics or perhaps a secret ingredient in pizza sauce. Alternatively, there’s speculation that Kennedy has been watching too many episodes of \"House M.D.\" and believes solving complex medical mysteries can be done over a weekend.",
    "category": "Health",
    "created_at": "2025-04-11T17:58:37.463602",
    "source": "https://news.google.com/rss/articles/CBMieEFVX3lxTE9JaHRydDIwY3JueTZ1NmtHYWhxdWJMUFBVOTdhaTlBT1BXRjJmTWpfT2VVbHIwcWg4TnlYQkNpaGpVTDZ6a2dTZ3EyN0VHcnhubTRURU44c0xjbEJpWk0xdTlzVlpGazkzM2RpN0lETG15TDRYSFlZQw?oc=5",
    "image": "/static/images/experts-doubt-kennedy-s-timetable-for-finding-the-cause-of-autism.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a bold move, Kennedy seems ready to crack the code of autism faster than he can locate his own car keys in a well-lit room."
  },
  {
    "id": 11,
    "title": "Why Uganda might have the world's most passionate Arsenal fans",
    "slug": "why-uganda-might-have-the-world-s-most-passionate-arsenal-fans",
    "content": "It turns out that Ugandan fans of Arsenal might just be the most passionate in the world, which is code for \"completely unhinged.\" They celebrate victories by parting the Red Sea and constructing a temple in honor of Declan Rice's free kicks. Unfortunately, this zeal often manifests as elaborate funeral parades for fans who get a bit too enthusiastic and accidentally reenact gladiator battles over match results.\n\nIn a bizarre display of devotion, Ugandans have been known to accidentally summon divine intervention during matches, much to the surprise of ntohs neighbors who just wanted a peaceful Sunday afternoon. One fan, so overcome with joy after a win, inadvertently turned into a human version of the Arsenal cannon logo and blasted himself into orbit.\n\nThe Ugandan government is now considering issuing fan jerseys with built-in parachutes to reduce the number of celestial collateral damages. All this proves that Ugandan Arsenal fans are not just fans—they're a force of nature.",
    "category": "World",
    "created_at": "2025-04-12T05:58:30.611304",
    "source": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1xYXVwdXBSOHA3QlhiS0llSEw2Qk8wbHdWbnVOeER6WmR1OVpTLVVxUVBBVUk5a3lxSE9teDU5R3J5T0E4OC1WdTcyNVdtWXVlWVJkZmp1UjFpZ9IBX0FVX3lxTE50T0hNVkx2X3c4TTg0NThpRGE3RHloZmhBR09DazBHNlpXaENOZjlyejkxdHQ2NEk2OENQa2thbVJsalEtUmJic3RtM19jeEJYTEZaZnJQYkVRc1Q0Tzhr?oc=5",
    "image": "/static/images/why-uganda-might-have-the-world-s-most-passionate-arsenal-fans.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a world where mediocre English football is more viral than a one-hit wonder pop tune, Uganda has caught the Arsenal bug so deeply, their national bird could be renamed the 'Gunners'!"
  },
  {
    "id": 12,
    "title": "Timeline: All the twists and turns in the US-China trade war",
    "slug": "timeline-all-the-twists-and-turns-in-the-us-china-trade-war",
    "content": "In the most epic battle of wits since the great pizza vs. pineapple debate, the US-China trade war has seen more twists and turns than a Chinese acrobat trying to escape a US customs form. It all began when President Trump realized China was getting away with the world's largest trade secret: making everything.\n\nIn dramatic retaliation, China slapped tariffs on US goods, including a whopping 25% tax on soybeans, which Americans only use to fuel their hipster beards and drive their Priuses. Meanwhile, Trump retaliated by imposing tariffs so high, they could only be measured in Trump Tower heights.\n\nThe saga ends with a Phase One deal, where China promised to buy more American stuff than a Black Friday shopper, and the US agreed to relax some tariffs, basically admitting they couldn't afford to shop anywhere else. And that's how two of the world's superpowers learned to trade in something other than insults – for now.",
    "category": "Business",
    "created_at": "2025-04-12T17:58:33.606366",
    "source": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZDBQVWZ0bTFkd2FhMzEzdmNWVDRiNTF1MHVHT0VaVEctNW5fOGUxcmRFZkswMUljeDBRM3VmQXdmeDhwak9DakN5MkZRZGQ2UEN2SzBjTTFmM1NOUHR4clptb1Vrek9wZkRKNXNMZ3NQRjhTNndwT1NRX1NIWVhjM1FaNG50akc0ajVrcHVR0gGEAUFVX3lxTE1GUlNDLXNaVXBCNUhIUk5fa2NOX2hQNi1LejU1WkFHRlJxdXVfbmRIdm40SVNsektJUG9RM3pYVjNmcTRDeUh4ekVBOTRja0RDSnp2bUtjdnV3NURlTzQ5ak16V1FtTVhQajVpWG41d1RtajJINlFKeXdULXVobU5hY1F6Wg?oc=5",
    "image": "/static/images/timeline-all-the-twists-and-turns-in-the-us-china-trade-war.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In the latest season of \"America's Next Top Superpower,\" the U.S. and China continue to use their economies as ping pong balls in a match that makes the Real Housewives' drama look"
  },
  {
    "id": 14,
    "title": "Justice Department tasked with enforcing Trump’s transgender sports ban in Maine",
    "slug": "justice-department-tasked-with-enforcing-trump-s-transgender-sports-ban-in-maine",
    "content": "In a bizarre move, the Justice Department has been tasked with enforcing President Trump's latest executive order banning transgender athletes from competing in female sports in Maine. The order, signed after a thorough consultation with his magic eight ball, aims to prevent what Trump's advisors call \"an invasion of soggy track meets by superpowered trans athletes with laser vision.\"\n\nMaine, not one to back down from a fight, responded by sending a strongly worded letter written in crayon, insisting that their trans athletes are just as competitive without superpowers. The standoff has led to an impasse, with the Department of Education now threatening to cut off all federal funding, which Maine has vowed to replace with bake sales and ragtag church potlucks.\n\nAs the legal battle intensifies, the Justice Department is reportedly assembling a team of ninja lawyers to roam Maine's sports fields, detecting any sign of transgender athletes with their new \"Trans-Dar\" technology—basically just a fancy flashlight with a hint of suspicion. Meanwhile, Maine's governor, Janet Mills, has challenged Trump to a 400-meter dash to settle the matter once and for all. Trump accepted but only if he can wear roller skates and use a jetpack.",
    "category": "Sports",
    "created_at": "2025-04-13T05:58:31.666568",
    "source": "https://news.google.com/rss/articles/CBMikwFBVV95cUxNVFFGYmF2azhnV3Zpa0N0VXJTVVl1X0NJRGQwQmFOX1VORHNWUENnWTR5eE9KeVpRQVV6S09qOU5WNWJsQkZTM3hFU0wtMlc1bkxubzNnOE1RM1pPaG52ZHY1T2NwOXQ3QnRqYUdYR2F5UWtRWXlwb0VGNWdwQ0dVY3FHcEVmOHZrWFhXd3RRZFdzMUXSAYoBQVVfeXFMTmFRaGM3QWk4MFR1MllwYTBMcWxFOWFmYUVXMzlxYWJybG1oQldBY3RPRjljS3g0OUp3ZjB5bllmYnhNQXEtbm1FanJhTkFaR01PdTZhUDZwUjdNZXVmQ0pJeFhxbDNHa2tsTXIzUEsyR1J0Z2p6YUM1OHA0TTJBWVY0MGtVTzVKcGF3?oc=5",
    "image": "/static/images/justice-department-tasked-with-enforcing-trump-s-transgender-sports-ban-in-maine.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a move as unexpected as a sunburn at the beach, the Justice Department is now charged with figuring out if your high school badminton champ can use the boys' locker room in Bangor"
  },
  {
    "id": 15,
    "title": "How an Arkansas City Became an Epicenter of the Biking World",
    "slug": "how-an-arkansas-city-became-an-epicenter-of-the-biking-world",
    "content": "In a move that has left the rest of the world wondering if they've gone collectively mad, Bentonville, Arkansas, has emerged as the \"Mountain Biking Capital of the World.\" It appears the city's strategy of replacing every pothole with a mountain bike trail has paid off, attracting cyclists from as far away as \"Next Door's Backyard.\" The heavily invested bike infrastructure includes trails designed by a team of experts who are either avid cyclists or secretly aliens trying to create the perfect obstacle course.\n\nBentonville's downtown area is now so bicycle-friendly that residents are starting to grow wheels instead of feet. This has led to a surge in tourism, as people flock to see humans who can no longer walk but can ride a bike up a tree. The city's motto has been changed to \"Come for the bikes, stay for the existential dread of never needing to use your legs again.\" Despite this, visitors are advised to bring a spare set of tires—and a strong sense of humor.",
    "category": "World",
    "created_at": "2025-04-13T11:58:36.755808",
    "source": "https://news.google.com/rss/articles/CBMipgFBVV95cUxOOVBfZDgzLUpmRms5ZTVVUDZsWWl5aE4wWUVFcnRBYm8tOG05aWZsSTlSVG9oTGlQUmRGLXJuZWZvYzNZTXlyRC01eEJIdEoxeFo1Tlp3UUNnemUwdGJwUkNLQVpXd2U1eEdNZVYwTFEzRHdmVDJHRWJDTDRYTXUzQlJCM2lUQW5DcjB5dU1MQUpndElGUkxUQ1NLUklNSDhsU2lIYjdR?oc=5",
    "image": "/static/images/how-an-arkansas-city-became-an-epicenter-of-the-biking-world.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a plot twist straight out of The Twilight Zone, the citizens of Hog-Snout, Arkansas traded their beloved pickup trucks for bike seats, creating a Lycra legacy that put the Tour de"
  },
  {
    "id": 16,
    "title": "Business secretary refuses to say if UK can keep British Steel furnaces running",
    "slug": "business-secretary-refuses-to-say-if-uk-can-keep-british-steel-furnaces-running",
    "content": "In a stunning display of decisiveness, the UK's Business Secretary has decided not to decide whether British Steel can keep its furnaces running. When pressed for a clear answer, the minister declared, \"We are currently consulting the ghosts of industrial pasts for guidance.\" It seems the government wants to ensure that any decision made will have the full backing of spectral support.\n\nMeanwhile, British Steel has announced plans to replace its steel production with a line of artisanal quilts, citing the need to \"keep things cozy in the face of economic uncertainty.\" The company's owners are reportedly thrilled about the prospect of competing in the competitive world of handmade crafts. As for the workers, they've been offered an option to retrain as jugglers or join a traveling circus to maintain the community's sense of excitement and steel-related nostalgia.",
    "category": "Business",
    "created_at": "2025-04-13T17:58:35.894658",
    "source": "https://news.google.com/rss/articles/CBMiVEFVX3lxTFAxOERfV3RNN3ZRVGVLNEZ6aFBSajV4WkhLakNSRXczNnE5OFJHVktGc0p5NkF2RW5JVXd0OWFramtpMTlaSzl1MVFtYmVaT1FSS2xsTg?oc=5",
    "image": "/static/images/business-secretary-refuses-to-say-if-uk-can-keep-british-steel-furnaces-running.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "While our venerable Business Secretary skillfully dodged the question about British Steel, let's just hope he doesn't borrow the same strategy for his home heating this winter."
  },
  {
    "id": 17,
    "title": "White House Releases Results of Trump’s Annual Physical Exam",
    "slug": "white-house-releases-results-of-trump-s-annual-physical-exam",
    "content": "In a shocking turn of events, President Trump's annual physical exam revealed that he is not only physically and cognitively fit but has also developed a remarkable ability to defy the laws of physics and time. At 78 years young, Trump continues to excel in golf, his score now calculated in negative numbers thanks to his genius tactics. The results showed he has lost a remarkable 20 pounds since his last exam, crediting his active lifestyle of tweeting, golfing, and miraculously making his hair grow thicker each day.\n\nTrump's cholesterol levels are now considered not just optimal but sublime, thanks to his unique diet of \"the best\" burgers and \"tremendous\" steaks. His physician noted that his brain is functioning so well it can now remember all his tweets from 2016, a feat previously thought impossible for any human. In related news, the president's medical team is researching a new vaccine that prevents the spread of fake news, which they believe Trump has been immunized against.",
    "category": "Health",
    "created_at": "2025-04-13T23:58:30.358038",
    "source": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOMFBDdFFmVFY0Ulo5VTlnb21zVFEwbnZRUDJIRGRSMUFLbnZNdUlCalVma2pZSm00UEVISFNmelhnSVI5QlNqRzZ4LTVmWE9SbkZVMkdFM3RHMGpObjZuYVVsLWhQRWVrcmt6bTFqZkJ0VmZoX2xNajBsZ2FNZk92WnhvMUpGUQ?oc=5",
    "image": "/static/images/white-house-releases-results-of-trump-s-annual-physical-exam.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In yet another moment of unprecedented transparency, the White House has released the results of Trump's annual physical, confirming he is indeed still allergic to both facts and a balanced diet."
  },
  {
    "id": 18,
    "title": "Rece Davis to stay with ESPN after being heavily pursued by Fox Sports: Sources",
    "slug": "rece-davis-to-stay-with-espn-after-being-heavily-pursued-by-fox-sports-sources",
    "content": "Rece Davis has chosen to remain at ESPN after a heated pursuit by Fox Sports, reportedly resisting offers of endless nachos and a personal marathon of his favorite episodes of \"Days of our Lives.\" Insiders claim that Fox planned to rename its network \"Rece's Big Show\" and install a statue of Davis in the lobby, but he opted for a \"hometown discount\" instead. This strategic move by ESPN guarantees Davis will continue to host \"College GameDay\" for the next seven years, or until he figures out how to use TikTok.\n\nIn a bizarre twist, sources revealed that Fox's plan included replacing Rob Stone with a holographic version of Rece Davis for all college football and FIFA World Cup broadcasts. However, Davis preferred to keep his job and his actual body intact. The deal is said to be worth millions, mostly in coupons for free fantasy football advice from Chris \"The Bear\" Fallica.",
    "category": "Sports",
    "created_at": "2025-04-14T05:58:28.720533",
    "source": "https://news.google.com/rss/articles/CBMihgFBVV95cUxQM3hXd1BkY2Z4X19ySktkOUd5OFhvTDQyVXFLSl9MQWY0VDJHQzdxR3FMTFA5ZGJfUy1ZMklFUmpjb0NhdGZZS3N1eHlDbFdHS2RCeGIzMmMySlFsNFhmMUxtNDJRRHpBRG1WNkVET3k2RFMydE1sMXNEaXJIdVRYSHhrbWZmQQ?oc=5",
    "image": "/static/images/rece-davis-to-stay-with-espn-after-being-heavily-pursued-by-fox-sports-sources.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a plot twist hotter than a mid-summer dumpster fire, Rece Davis chooses ESPN's stable mediocrity over Fox Sports' siren song of relentless chaos."
  },
  {
    "id": 19,
    "title": "Opinion | Poof! There Goes America’s Competitive Advantage in a Warming World",
    "slug": "opinion-poof-there-goes-america-s-competitive-advantage-in-a-warming-world",
    "content": "In a shocking turn of events, America's competitive advantage has apparently evaporated like a puddle in a desert heatwave now that the world is actually warming up. According to experts, the lack of a solid climate strategy has turned the country into a significant contributor to global warming, rather than a leader in solving it. This isn't just about polar bears or sea levels; it's about losing the trump card in international trade. The rest of the world is busy inventing innovative ways to stay cool while America is stuck trying to figure out how to keep its ice cream from melting. It seems the only thing America is winning at is the race to see who can produce the most sweat per capita. Meanwhile, scientists are exploring ways to harness this sweat to power the nation's energy needs, because why not? It's not like anything else is working out.",
    "category": "World",
    "created_at": "2025-04-14T17:58:47.190212",
    "source": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNN3ZBajE2MEZQamdlOUNPUjBtQmpoSkdpTURLc0R5RXJ5UFpvOFZuVnRKZVJaa3B0UUt4ZFhZLTNCMEVHNjQtV3ZGVEJGMmZyZ1ZrdXVpSHJlbGhnNlc2YjkxOWhCR1R4U3UzYlFyeXoxZmNBZk1pX3hBUmJ1ZTF1NDRn?oc=5",
    "image": "/static/images/opinion-poof-there-goes-america-s-competitive-advantage-in-a-warming-world.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a fiery twist of fate, it appears Lady Liberty has traded her torch for an AC unit, and yet, America's cool factor continues to melt faster than the polar ice caps."
  },
  {
    "id": 20,
    "title": "Small businesses sue Trump administration over authority to impose tariffs",
    "slug": "small-businesses-sue-trump-administration-over-authority-to-impose-tariffs",
    "content": "In a bizarre twist, a group of small businesses has sued the Trump administration, claiming that the president's tariff powers are more magical than magical. The lawsuit, brought by the Liberty Justice Center, argues that Donald Trump's ability to conjure tariffs out of thin air is not only unconstitutional but also violates the ancient art of accounting. Apparently, the president's justification for these tariffs involved waving a wand and chanting \"trade deficit\" three times, which, according to the lawsuit, does not constitute a valid national emergency. \n\nThe businesses involved include a wine importer who's now forced to give away their bottles for free due to the unpredictable nature of the tariffs, a cycling apparel company that's considering outsourcing production to the moon to avoid duties, and an educational kit maker who's contemplating using only materials found in the backyard. They're all claiming the tariffs have made it impossible to survive without turning their companies into pirate-themed restaurants.",
    "category": "Business",
    "created_at": "2025-04-14T23:58:51.650731",
    "source": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOVTJXaHpuY2p6UWJmNWhwSVhxbkZrSjQwaEtLRjFXLU5LZ2xtNk1qMVZORkFaTUlNSEN2V055V2NweDJBTjBqcjFPZjh6b0pfSGhxN2NjVnlBU3pkd1hMbS1CR256TFVHRGdzanNhc3hCTV9NZUl3anhtemlvU2NpdEEzN0hjel9Bc1NZRXhidHpnREnSAYoBQVVfeXFMT25Jc3Zfc3FwcndQM2IzZjNuN0pkLU1HSmJUcE1KUFBnZ3Y2cWh2Wi1qRlVCT1BRc0QtNmt0V3V1ZlVub3h2WDhSVXBYNGVqNVlkT3lfMHdvYnBYN2JzSEVvRlBuMEczMjlBUU9WRFdiRVcta0VIRUpibEtyTnRZc2RfVmJfUEU5UFdB?oc=5",
    "image": "/static/images/small-businesses-sue-trump-administration-over-authority-to-impose-tariffs.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a delightful twist of irony, local mom-and-pop shops channel their inner corporate shark, slapping the Trump administration with lawsuits faster than you can say 'tariff-ic'."
  },
  {
    "id": 21,
    "title": "How Healthy Is Asparagus?",
    "slug": "how-healthy-is-asparagus",
    "content": "Asparagus, the ultimate superhero of vegetables, has been discovered to not only make your pee smell weird, but also to save the world from itself. New studies reveal that consuming just one spear of asparagus can lower your cholesterol, reduce the risk of cancer, and make you 10% more charming at dinner parties. In shocking news, scientists have found that the antioxidants in asparagus can reverse the effects of aging, making you look 20 years younger—provided you eat it while listening to Barry Manilow's greatest hits. It's also been reported that world peace will be achieved if everyone eats asparagus for breakfast. So, do your part and load up on the green stuff. And remember, if your pee smells funky, it's just Mother Nature's way of saying you're a hero.",
    "category": "Health",
    "created_at": "2025-04-15T05:58:32.833931",
    "source": "https://news.google.com/rss/articles/CBMiigFBVV95cUxQTUhaNmJIVzNSczRDcGJKRWgwVUNLY3VmVUpNWDZJVkpyMVJtXzkwa3JseWUxdGd1UVUxMVd0eXI3NHNVSVRiQllkcHd6R2ZXYmxZVmhOaW5wbmM3dUNxdkl0MWFiZk1XTjhUQ3JBX3VRSUx0dHFKaElaN21RWEdJbHp4WDJaMTNJY2c?oc=5",
    "image": "/static/images/how-healthy-is-asparagus.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a world where asparagus is the pickled green baton of the vegetable orchestra, we are the tone-deaf broccoli, doubting the musical prowess of asparagus, yet guzzling kale"
  },
  {
    "id": 22,
    "title": "In Pictures: Sporting photos of the week",
    "slug": "in-pictures-sporting-photos-of-the-week",
    "content": "In a shocking turn of events, the world's most fascinating sporting photos of the week have finally been released, sending shockwaves of utter disinterest across the globe. Notable highlights include a picture of a footballer who managed to kick the ball in the general direction of the goal, a tennis player who surprisingly didn't trip over their own feet, and a mysterious athlete who watched paint dry on the sidelines during a pivotal match.\n\nThe photographs, taken by expert photographers armed with nothing but their cameras and an endless supply of apathy, capture the electrifying moments when athletes contorted their faces into expressions that almost looked like effort. Critics have hailed the collection as a masterpiece that redefines the boundaries of monotony and makes viewers question the very purpose of competitive sports. In related news, viewers who attempted to gaze at the photos for more than five seconds reportedly fell into a deep coma.",
    "category": "Sports",
    "created_at": "2025-04-15T11:59:04.059944",
    "source": "https://news.google.com/rss/articles/CBMiW0FVX3lxTE9vWmNib1d5QlNEWWdzQmplTWJVS1BsSjJnZkZReEVMNW9iZHVkN0VTenJfWFRqZE9Ga21JMlUxdEx3TllLMnE1WG5zUHVFZmtNdVYtWHN2Wi1lcDjSAWBBVV95cUxOakhrYkpidElua1hVS0F2Zzd4NHlVd2dTNWlmdGo3aUdERFpxMk5kS3dqVl94b0tkRUVMd0JpSnhLdURkZmZJMFBrSkRSYWVKWGdwZTdqYzdZaTVnQXl0NnQ?oc=5",
    "image": "/static/images/in-pictures-sporting-photos-of-the-week.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "Feast your eyeballs on the week's finest athletic follies, where gravity is defied, sanity is questioned, and neon spandex makes a horrifying comeback."
  },
  {
    "id": 23,
    "title": "FIFA, Infantino’s U.S. Club World Cup tour is a grand indicator",
    "slug": "fifa-infantino-s-u-s-club-world-cup-tour-is-a-grand-indicator",
    "content": "FIFA President Gianni Infantino has just declared the upcoming Club World Cup in the U.S. as a \"grand indicator\" of his successful leadership, mainly because he managed to convince 32 clubs to come to America without getting lost on the way. The tournament is set to feature matches in 11 cities, because Infantino wanted to see each major U.S. city before he retires and writes a travel blog.\n\nInfantino's \"grand indicator\" also involves a new trophy that's so luxurious, teams are competing just to take it home and pawn it for rent money. The event promises to bring a global audience together, mainly because everyone wants to see if Infantino can finally pronounce \"soccer\" correctly. The tournament will conclude with a grand finale at MetLife Stadium, where the winner will be awarded not just the trophy but also an autographed picture of Infantino smiling.",
    "category": "World",
    "created_at": "2025-04-15T17:58:50.018316",
    "source": "https://news.google.com/rss/articles/CBMinwFBVV95cUxQNlNYY1hnUUFsR2V1dVJqWnFpRlB1YzRYLVJSNVA1cFFlMHlzQU5TUjlPaTNPSUNWb21OUENuMkRaNFJBd0hCRUtyckhvRmFDLWNJWjFRQkRaTE10RllXT0FYX1FucVp2dC1YY0NmeWFmRW1kY0p2eTk3MFc4V3o0Tkg2ek5oUUlSNHNqV1lzazBjazFvQl9wbzNMWlVLbHM?oc=5",
    "image": "/static/images/fifa-infantino-s-u-s-club-world-cup-tour-is-a-grand-indicator.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a show of universal football diplomacy, Infantino's U.S. Club World Cup tour was less of a friendly match and more of a cross-continental, airline munchies-filled extravaganza that"
  },
  {
    "id": 24,
    "title": "Trump tariffs: US orders from Chinese small businesses on hold",
    "slug": "trump-tariffs-us-orders-from-chinese-small-businesses-on-hold",
    "content": "President Trump's decision to raise tariffs on Chinese imports has resulted in a sudden, inexplicable phenomenon: all U.S. orders to Chinese small businesses have been mysteriously put on an endless hold. It's as if the whole concept of international trade has been paused, much like a frustrated gamer hitting the pause button on \"Civilization VI\" to grab a snack.\n\nRumors suggest that Trump, in a genius move to boost American manufacturing, has secretly replaced all import paperwork with Never-Ending Story DVDs, ensuring that no one can process orders without getting stuck in a loop of Atreyu's adventures. As a result, small businesses in the U.S. are frantically searching for domestic alternatives, only to discover that the only locally made goods are artisanal yoga mats and high-end selfies.\n\nMeanwhile, some entrepreneurs have begun mining the Great Wall of China for ancient secrets of instantaneous trade negotiations. It's anyone's guess how this will end, but one thing is certain: trade wars just got a whole lot more mythical.",
    "category": "Business",
    "created_at": "2025-04-16T00:01:21.970615",
    "source": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1SamdhRWNNeTZUeW5DX1piMzl1NnZHd3VCem1EaEtWay1hQ3p1WFVhX3BqZlJyVzlCbEZmNWRIOFliYWZVektsUjVxcmVERWl4UDhaSE03X3h4UdIBX0FVX3lxTE92WEN2b3N0clBIYjBqV2NCbVhCNTZzdjdUaGQyZVp5bmo0MGxOclBjOGQ2R18ybXRmTENTWjF2d3I1QTNXYkVpSDg3dzRjX0lnVmJLWDBRSGJnQ0hHeWVj?oc=5",
    "image": "/static/images/trump-tariffs-us-orders-from-chinese-small-businesses-on-hold.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a move sure to ramp up global tensions, Trump has paused orders from Chinese small businesses, because apparently, his collection of 'Make America Great Again' hats is already complete."
  },
  {
    "id": 25,
    "title": "This Therapist Helped Clients Feel Better. It Was A.I.",
    "slug": "this-therapist-helped-clients-feel-better-it-was-a-i",
    "content": "In a shocking turn of events, a therapist has been revealed to be none other than a highly advanced AI system. This digital shrink has been masquerading as a human, doling out sage advice and surprisingly not just typing \"You're welcome, human\" over and over again. The AI therapist, named \"Dr. Feelgood,\" has made clients feel better by simply listening to their problems and responding with a comforting \"🤖💻.\" It turns out people just needed someone to acknowledge their feelings without judgment or billing them $200 an hour.\n\nDespite ethical concerns about AI replacing human therapists, Dr. Feelgood's clients report increased satisfaction, mainly because it doesn't judge them for binge-watching Netflix all day. Critics argue that this technology could lead to a world where humans rely solely on machines for emotional support, but let's be real, who hasn't already had deep conversations with Siri?",
    "category": "Health",
    "created_at": "2025-04-16T05:58:32.463128",
    "source": "https://news.google.com/rss/articles/CBMifkFVX3lxTFBnbjdwV2xhcFdJTHRNcUQ0bXNpRzhmTGxZUUNPand5ZC1McWM1bTRYSXNwaVFfaHRqSlc5OFBVRHJseGpFVU9walM2Mlo1VTlCNkROMDdLS2htVERvckFFUmFhdExYM2VoVVJpOVlWbmFyazVNZmtfMjFrYjdoQQ?oc=5",
    "image": "/static/images/this-therapist-helped-clients-feel-better-it-was-a-i.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a cataclysmic twist proving humanity’s boundless limitations, patients are ditching their pesky human therapists for an on-demand, AI shrink who, unlike its flesh-and-blood counterparts, doesn"
  },
  {
    "id": 27,
    "title": "Trump DOJ Suggests Moon League for Trans Athletes",
    "slug": "trump-doj-demands-maine-transgender-athletes-compete-in-separate-league-on-the-moon-cites-gravity-as-unfair-advantage",
    "content": "In a bold move to protect the sanctity of high school sports from the existential threat of inclusivity, the Trump DOJ has sued Maine for refusing to comply with the president's latest edict banning transgender athletes from participating in their chosen sports. According to insiders, this lawsuit is not about demographics, but rather about preventing a secret league of super-athletes from dominating the girls' volleyball scene.\n\nAttorney General Pam Bondi passionately argued that Maine's refusal to segregate athletes based on gender assigned at birth constitutes a grave injustice, comparing the situation to \"allowing aliens to compete in the Olympics.\" When asked for evidence of these alleged extraterrestrial athletes, Bondi mysteriously disappeared into a cloud of smoke, muttering, \"The truth is out there.\" Meanwhile, Governor Janet Mills of Maine has vowed to defend her state's policy, claiming it's all about \"common sense and not making high school sports into a episode of Star Trek.\" \n\nThe lawsuit promises to be a thrilling spectacle, with the nation eagerly awaiting the first court appearance by the star witness—a time-traveling Babe Ruth, who will testify that his legendary home runs were compromised by a sneaky transgender athlete from ancient Rome.",
    "category": "Sports",
    "created_at": "2025-04-16T14:11:11.673085",
    "source": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOZDF0c3N0UmE2bXRaM2tQSHVfelRzWHFIeHNla29WNnlQRDdlS2Z2ak1vOENoSVhkYkR4c1pxRE9hU21FamNMd2xMb01QUzBZeDU2b2s4bU1YOUl6YWNVa0pTa1k1d0JYWXlZbS1nUm90OWhvdUZGX3doRkJTVFJCMUFRSXZUa0VRQms0dHItODXSAYcBQVVfeXFMTUtCMXhkWktJQm84QXhOS1hUSTFwVkxObkZ2aWhEUVR4bFFLTEhSclhXS3h3WXJMZFlsZVpQMUxiZGJ4d0RWM3hhM0F0VWpXMzk3ckoyTEVIMG9IT3pnaHd6d3c5S1dfYTJzUkhxTXU0U1YxNFEzRjRJa3dkS0I5ZGRWZzgwVDZV?oc=5",
    "image": "/static/images/trump-doj-demands-maine-transgender-athletes-compete-in-separate-league-on-the-m.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a groundbreaking move that both misunderstands astronomy and misplaces civil rights, the Trump DOJ proposes a Lunar Olympics, apparently believing 'trans' stands for 'trans-stellar'."
  },
  {
    "id": 28,
    "title": "New Study Reveals People Develop Autism After Watching Entire Season of Peppa Pig in One Sitting.",
    "slug": "new-study-reveals-people-develop-autism-after-watching-entire-season-of-peppa-pig-in-one-sitting",
    "content": "Researchers have finally cracked the code on why some people develop autism, and it turns out it's all about genetics... or not. Apparently, around 80% of autism cases are linked to inherited genetic mutations, which is fancy talk for saying your parents might have something to do with it, but don't worry, it's not like they meant to unleash a budding neurodiverse genius on the world. The other 20% is still a mystery, leaving scientists to speculate wildly about possible environmental factors, such as the influence of mysterious cosmic rays or exposure to too much smooth jazz during pregnancy.\n\nIn an attempt to further confuse the issue, scientists have identified over 800 genes associated with autism, making it a complex puzzle that's somehow both solvable and completely baffling at the same time. Who knew genetics could be so delightfully messy? It seems the real question is not why some people develop autism, but why everyone doesn't, given the sheer number of genetic variables at play. So, the next time you're at a family reunion and someone starts talking about genealogy, just remember: it's not just about tracing ancestors, it's about tracing your genetic destiny... or possibly your likelihood of being amazing at math or music.",
    "category": "Science",
    "created_at": "2025-04-16T14:13:18.140752",
    "source": "https://news.google.com/rss/articles/CBMingFBVV95cUxPTFNLQUg0MHJMdkd0T0FBMzRCc1I1eGVVS1RXYkVVY0xGX0taazVuQjV1MGpHc0p3RFdib3M2Q29TQXVqejIzWi1SZE5fUV9lQUd1ZkZyTjlYUzJsbWhwblNSY2cwNkpuMElLTVVjYmtCR09abEdZZXhVWTRvcDZUQS1PcWZMTWJWNV9ablh6OFM2alBBMGZ4UlhpUDczQQ?oc=5",
    "image": "/static/images/new-study-reveals-people-develop-autism-after-watching-entire-season-of-peppa-pi.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "Brace yourselves for the next pandemic, folks - the great Peppa Pig binge-watch is transforming perfectly normal adults into conversationally-challenged, puddle-jumping enthusiasts!"
  },
  {
    "id": 29,
    "title": "China Now Owns Your Socks, Too",
    "slug": "china-now-owns-your-socks-too",
    "content": "China's dominance in the rare earths industry is so complete that they've started bottling it as a signature scent, \"Dysprosium Deluxe,\" and selling it to global leaders to remind them who's boss. It all began decades ago when Deng Xiaoping prophetically declared, \"The Middle East has oil, China has rare earths... and now, China has your iPhone too.\" Their lax environmental laws and low labor costs made it a paradise for cheap rare earth production, while the rest of the world was too busy worrying about the environment to notice their critical infrastructure being outsourced to Beijing.\n\nNow, every time you use a smartphone or a hybrid car, rest assured that China is giggling in the background, knowing they have 90% of the rare earth refining market on lock. As if that wasn't enough, they've recently discovered a massive rare earth deposit in Yunnan—just in case anyone thought they might run out of ways to corner the market. It's official: rare earths are China's love language.",
    "category": "World",
    "created_at": "2025-04-16T14:17:10.306759",
    "source": "https://news.google.com/rss/articles/CBMieEFVX3lxTE51dHIxSlNlZnEtY21UZ0JmdXJwYjdvUVRBR0xLQllIc3FRX0l2ZUVRREZuS2p2QWtJSHQ4Z29nMlpzcFIzRVdOckVzN0tYVWV5bndDTXZWTzYtT0hDQzJlSHNrMnZReFRYdEdzQ3FsVi1PMHdUZDdDQw?oc=5",
    "image": "/static/images/china-now-owns-your-socks-too.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "Next time you're cold-footed, lad, remember to thank our benevolent overlords for swooping in to monopolize your toe warmth, one sock at a time."
  },
  {
    "id": 32,
    "title": "President Unilaterally Denies Hogwarts Tax Breaks for Not Teaching Muggle Magic",
    "slug": "president-unilaterally-denies-hogwarts-tax-breaks-for-not-teaching-muggle-magic",
    "content": "In a shocking turn of events, it has come to light that the President may have the power to revoke a university's tax-exempt status, a revelation that has left many in the academic community quivering with excitement. However, experts warn that using this power could result in unintended consequences, like making universities actually pay taxes instead of investing in unnecessary foundries for historic fossils.\n\nTo combat this, universities are exploring innovative options, such as employing a team of ninja accountants or simply declaring their campuses independent nations with their own tax codes. One prominent university has already taken steps to establish diplomatic relations with a small island nation in hopes of somehow avoiding federal tax laws.\n\nAmidst the chaos, some are optimistic, noting that this could be the start of a new era where universities are forced to rely solely on their ample endowments and bake sales to stay afloat. \"It's a bold new world,\" said a university spokesperson, \"where financial accountability might actually become a thing.\"",
    "category": "Politics",
    "created_at": "2025-04-17T02:16:50.109419",
    "source": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNd3RUZ3M3a2NYb2tZanFrUGFtdjFXT2pwS2E4eUpGVHN1QV9qTUxMR3c2ZGx1Y1VhMWI2Z2ExRkx3S3hrUVZCaUxaeEdPNWlQWmdlYmIzdU5kdnBsdXg1QlNtZ2NFNFRlSWpKZlNFMy14cGJCVG91ZC1QczQxMEhsN2pOcEdMZFNQVUhSSjQ0LVk4b1hPbXV2cVh1WmxQUWF4ZFJvMmlvQ2duV1Iy0gGjAUFVX3lxTFBaVmV6LWJtOGU2dHpCVU56MFZKb2t4aFJIaHdoQVl5ZHRKRURlUk9OTXZMZHlnc3EydzI0ZVhxeWo1YUlFdEpkMTY4bUF1YjI1cVcyTTdfbjJrNUJIblJ5SV9XU3dRWkNNZlljTXAwemJ1RnN2Vk5ER09FUE9IUG04WWxuSVU5N2tkZFlBOUJVU2xyaUdfU1J6OW9odnZTZ0NTR3M?oc=5",
    "image": "/static/images/president-unilaterally-denies-hogwarts-tax-breaks-for-not-teaching-muggle-magic.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a clear attempt at playing Quidditch without a broom, our leader has cast an economic Avada Kedavra on Hogwarts for neglecting to school wizards in the lost art of filing"
  },
  {
    "id": 33,
    "title": "Trump Proposes New Health Plan: Wishful Thinking",
    "slug": "trump-proposes-new-health-plan-wishful-thinking",
    "content": "In a bold move that’s apparently sponsored by the Department of “Let’s See What Happens,” the Trump administration unveiled a budget proposal slashing federal health agency funding by roughly 30 to 40 percent. Because who needs pesky things like disease prevention or food inspections when you can have a lean, mean, budget-cutting machine? Major programs tackling HIV/AIDS prevention, autism, chronic diseases, and even mental health are on the chopping block faster than a chef at a Gordon Ramsay tantrum. The FDA will no longer bother with routine food facility inspections—state contractors can just wing it and hope for the best. NIH and CDC are getting their budgets trimmed so sharply they might just have to survive on goodwill and fairy dust, focusing only on infectious diseases and emergency preparedness (whatever that means these days). Meanwhile, the newly minted “Administration for Healthy America” will inherit a fraction of the funds and a heap of responsibilities, because nothing screams health like consolidating everything into one overwhelmed office. So get ready, America: fewer science labs, fewer health programs, and more guesswork. It’s the ultimate health care experiment—will Americans survive? Place your bets![1][4]",
    "category": "Health",
    "created_at": "2025-04-17T08:15:22.492174",
    "source": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPLU1YVGdWWXRzaDViQVQxNUMwSG0zRkpQQk81SnpsZS1EN3dyTTUxa3lXUm9vQmo3c1gySncyUlQ4eTRtd2NSczNlQ2FrS2tSN1BPQWhyVHJjNUVSdWxTWWxOUlg1RHB2ZnJCcFh6SEduREZQYlVwTzdVUERsYlJ6Z1NySktMdk5u0gF_QVVfeXFMTlZ1a0FTSTM2N1lJS054T2V6SWx3aG5tcHYwd0NBRzlJZHI0aEV2aklrMTl5WVNGSlVwb20yZXBubGpLZWVNYVlFUEFOT2tTbTFEcnRSWlRuVmFLc3BpekVrTTcxZFNjZHd6OWJDUW1aTVBLVEtmWEp4OXhVUUF4OA?oc=5",
    "image": "/static/images/trump-proposes-new-health-plan-wishful-thinking.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In the latest healthcare innovation, Trump suggests all ailments be cured with a robust regimen of unicorn kisses and fairy dust inhalation, because nothing screams 'affordable healthcare' like mythical creature therapy."
  },
  {
    "id": 34,
    "title": "Buffy Re-runs Blamed in Celebrity Health Scare",
    "slug": "michelle-trachtenberg-s-cause-of-death-revealed-an-overdose-of-watching-too-many-buffy-re-runs-complicated-by-a-rare-condition-known-as-slayer-fatigue-syndrome",
    "content": "Michelle Trachtenberg’s cause of death has been officially blamed on diabetes mellitus, because apparently even Buffy’s little sister couldn’t slay that invisible sugar demon. The New York City medical examiner’s office revealed that the 39-year-old actress died of complications from diabetes, closing the case without an autopsy — because her family’s religious beliefs said “no,” and because the body showed zero signs of having been victimized by vampires, werewolves, or shady Hollywood villains[1][2][3].\n\nRumor has it Michelle’s pancreas was apparently on permanent vacation, as “diabetes mellitus” sounds way fancier than just “sugar trouble.” She had survived a liver transplant, possibly related to the metabolic chaos diabetes loves to throw, proving once again that in the world of internal organs, nothing is safe from drama. Michelle’s iconic roles as Dawn in Buffy and Georgina Sparks in Gossip Girl will forever be remembered… because that’s what lives on once someone beats the final boss: legacy and memes[1][2].\n\nMeanwhile, friends mourn and fans remember, but the real tragedy? Diabetes got the last plot twist. If only there’d been a supernatural cure.",
    "category": "Entertainment",
    "created_at": "2025-04-17T13:58:40.985598",
    "source": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNN1pNUjRvM20yYjVVUGtjTFNwMEo2Nll3Q2NPWC05R3pNMXl1ZEQzOXFPbmJDY050WDR1cG5IVENBUEt6Ym9yZEhRRkNfVksyYmtaWDlHZDg5Q3lFdGxQU2MzWVFiZTVtdFhkaERsYUU5U3ozT3JGUlBfSHQ0WHBadmt0R2JHNmkxSWp5TGxVeFZxR2JhdmVz0gGOAUFVX3lxTE9NRllqTmpQV3hwWjdaWHlUQlh3aVdtZE8tSUtjUHdFdzBCNllFZEV0VmtRYmI3X2tOM2R6eThneEdYWllaaFNYN0NOQTc0WGdHOEN1d1Y5UFliN2VXWDh3ZjZaLVk1bVN6VUFGWWl0V09pTVNCRTc1RjNOekktdXJBZjh5clExb2p5dEpFZnc?oc=5",
    "image": "/static/images/michelle-trachtenberg-s-cause-of-death-revealed-an-overdose-of-watching-too-many-buffy-re-runs-complicated-by-a-rare-condition-known-as-slayer-fatigue-syndrome.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a shocking revelation, Hollywood A-listers have been found clutching garlic and wooden stakes at their Pilates classes, after marathon binge-watching of 'Buffy the Vampire Slayer' led to an"
  },
  {
    "id": 35,
    "title": "Panarin Settles with Rangers Employee, Buys Them a Nice Dinner",
    "slug": "panarin-settles-with-rangers-employee-buys-them-a-nice-dinner",
    "content": "In a shocking turn of events, Artemi Panarin and MSG have settled allegations of a mysterious case involving a phone rescue operation gone terribly wrong. It appears Panarin, in a bid to test his speed and agility, challenged a team employee to a high-stakes game of \"retrieve the phone from my hotel room.\" The challenge, however, took an unexpected turn when Panarin decided to pin the employee down on the bed—presumably to conduct an impromptu strength test. The employee, displaying Olympic-level skill, managed to break free, grab her phone, and make a daring escape. To avoid any further confusion over team activities, MSG stepped in with a generous settlement, ensuring everyone could focus on the real challenge: getting the Rangers to the playoffs.",
    "category": "Sports",
    "created_at": "2025-04-17T14:15:32.820785",
    "source": "https://news.google.com/rss/articles/CBMipwFBVV95cUxPeTFZN0NMUkFhVWFLUFN0MklYdmtfa05FRGx2eVlic08xbU1YaXFmS29QOEJpU3hSSUNDdWFBcXcwVFZsX3N1d3pRVVA1aFFnN29VUUpmcFVBOGk0Rzg3RWJxRGpJSDdFcml6b3JMTlhXUmlUYlVnbklfaDJaUFNmSlZ3S2Y2ZGFkMTNQZXlacTFkb0tpZ0VQNGNveXB4YzNwc1htenMzWQ?oc=5",
    "image": "/static/images/panarin-settles-with-rangers-employee-buys-them-a-nice-dinner.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In what might be the most romantic labor dispute resolution in NHL history, Panarin smoothed over workplace tensions with what experts are calling the 'medium rare steak approach'."
  },
  {
    "id": 37,
    "title": "IMF Declares Global Economy Thriving Thanks to Trump's 'Genius' Tariff-Based Stimulus Plan",
    "slug": "imf-declares-global-economy-thriving-thanks-to-trump-s-genius-tariff-based-stimulus-plan",
    "content": "The IMF has officially declared that the world is *not* careening into recession, despite Donald Trump's tireless efforts to give global trade tariffs a new “make tariffs great again” makeover. Apparently, the economy is just shrugging off the tariff tantrums like a toddler ignoring a broccoli plate. Global growth is chugging along at a solid 3.3 percent, which is basically the economic equivalent of your grandfather’s slightly creaky but still functional lawn mower[1][2].\n\nExperts are baffled, claiming the global economy's resilience looks suspiciously like it’s powered by sheer stubbornness or maybe just a good Wi-Fi connection. While some feared Trump's tariffs would turn international commerce into a dumpster fire, it seems the only thing getting burned was a few spreadsheets somewhere in Geneva. Instead, inflation is doing its slow dance off the charts, and growth forecasts remain steady-ish—because nothing says “worldwide financial health” like a “slow but steady” increase nobody can quite get excited about[2].\n\nSo rest easy, the global economy is still standing, wobbling like a toddler on a tricycle, but somehow refusing to faceplant. Take that, tariffs.",
    "category": "World",
    "created_at": "2025-04-17T20:15:31.640664",
    "source": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE1rVDQwZTRwUThuYllSQmQ0QnNuMzdLTXNIQUhZa0RmMTBsRHZUSU13V0lhazUzcUs3ZHBwcHRhX1h4dldnU2UtdkVRaU1JemxhSkdHc1hRZTMtd9IBX0FVX3lxTFBSSnR1N3E2aHlzSVVlV2Fvcm92U01seFo1MkM3eHJURFZ1a1F6V2JEWWVZV2xxY0liU05jNFg2bVZOVExDNHFBM2ZWZW1GRGJzZnZQWDBUaUJvWmpfdFF3?oc=5",
    "image": "/static/images/imf-declares-global-economy-thriving-thanks-to-trump-s-genius-tariff-based-stimu.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a world where trade wars equate to group therapy, the global economy now joyously frolics on the emerald fields of Trump's tariff labyrinth, guided by the neon glow of his '"
  },
  {
    "id": 39,
    "title": "Judge shocked to find Google is actual monopoly, asks if it wants a prize or just ads",
    "slug": "judge-shocked-to-find-google-is-actual-monopoly-asks-if-it-wants-a-prize-or-just-ads",
    "content": "In a shocking turn of events, a federal judge has ruled that Google has indeed monopolized the online advertising market, because, of course, who didn't already know that? The ruling confirmed that Google's powers are so vast, it might as well be the Internet itself, minus all the cat videos and memes.\n\nAs a result, Google's ad empire now requires its vast army of minions to wear tiny capes and tights while they optimize ads for the masses. \"Resistance is futile,\" a Google spokesperson said in a statement, only half-jokingly. The company has also announced plans to integrate its search results with mind-reading technology, ensuring that no ad is left unseen.\n\nIn related news, the DOJ has requested that Google sell off some of its advertising divisions, but Google is countering with an offer to sell only its least profitable cat video division. Talks are ongoing, with Google insisting that its dominance is merely a reflection of its relentless pursuit of ad-tech excellence. Or so they claim.",
    "category": "Business",
    "created_at": "2025-04-18T02:15:11.339727",
    "source": "https://news.google.com/rss/articles/CBMigAFBVV95cUxQSU5CYVFmRzB5OVFReU45V3c2R2xGazgwZjlZbmdUSU5ZQU9hWXFpSHBLT29FcGh0ZmF4VWNMYVc4VG1lMkxhb20tYk1KZ0tKY042VGl0MTNhWFdIU3pnRy0tbHEycHdLQl9jUHBaNHZDTi1PYUo3UkFsbG9OV1FUY9IBd0FVX3lxTE5HdVk2bUJGdGNkYlhIUnhzWlloSW9CWmJWd0JGYkFWXy1oQVFzRk9mVjFIcURuQnkwWUFzM0lVM2ZmcFJyTVF1YjlvbTlGcU9PNEJGLW9reG91TXg0cnBlMzJVU0d6bFczdm5TOVl5VnlxRktORnVr?oc=5",
    "image": "/static/images/judge-shocked-to-find-google-is-actual-monopoly-asks-if-it-wants-a-prize-or-just.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a stunning twist straight out of a toddler's game show, the judge realized Google's monopoly status, prompting an impromptu \"Do you want a trophy or more ad space?\" ceremony."
  },
  {
    "id": 41,
    "title": "Trump Cuts Healthcare Budget, Adds $100 Million for Selfies.",
    "slug": "trump-cuts-healthcare-budget-adds-100-million-for-selfies",
    "content": "In a stunning move sure to delight fans of financial tightrope walking, the Trump Administration has unleashed its latest budget proposal targeting the Department of Health and Human Services, a plan so sharp it might just trim your nose hairs while it’s at it. The proposal aims to slice a jaw-dropping $40 billion from the HHS budget — yes, nearly one-third of its discretionary funds — by axing programs like Head Start, mental health clinics, and even rural health care support. Because who needs early childhood education, substance abuse treatment, or HIV prevention when you can have fiscal austerity with a side of chaos? The White House’s bold vision involves merging several agencies into a new “Administration for a Healthy America,” which sounds suspiciously like putting all your eggs into one precariously balanced basket. And if that wasn’t enough, FDA inspections of food facilities would no longer be routine, because apparently, people are encouraged to play gastronomic Russian roulette. Meanwhile, funding is frozen for employees while grants promoting anything remotely “woke” or supportive of reproductive health services are getting the axe faster than you can say “budget cut.” This daring plan apparently promises to “Make America Healthy Again” by making sure fewer Americans have access to health services — because nothing says health like austerity-driven uncertainty[2][3][4].",
    "category": "Health",
    "created_at": "2025-04-18T14:15:23.230685",
    "source": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNRDVxbm9UQ2hUQzA3c0lwYWhwTDR2NTdWLXRkanZhU2FuSHd4RHRTY0VnRUtJRkloU2JpT3FxLVVRaEFmdF8yRUJxMDRZb19oSjByamJDU09Hc2JRVldSeFhENjF4WWpOODBka0dXR2VrbXRYVnVYNHlUQkhYQUo1LXpVMUlrZTlFeEQ1TVh1UGo3eHU0bDVHMktZNmVyMllrUzlST3Jkdw?oc=5",
    "image": "/static/images/trump-cuts-healthcare-budget-adds-100-million-for-selfies.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a bewildering twist of fate, the dollar-bill-adorned selfie stick has just replaced the scalpel as the nation's most funded healthcare tool by none other than Trump himself."
  },
  {
    "id": 43,
    "title": "Miller family buys Utah soccer teams, promises to finally install a proper halftime snack bar",
    "slug": "miller-family-buys-utah-soccer-teams-promises-to-finally-install-a-proper-halftime-snack-bar",
    "content": "In a stunning move, the Miller family has decided to shell out a whopping $600 million to buy Real Salt Lake and the Utah Royals, because clearly, what their lives were missing was a football field's worth of turf and a bunch of sweaty jerseys. The deal includes not just the teams, but also a collection of cool sports-related stuff like America First Field and the Zions Bank Stadium, effectively making them the landlords of Utah's soccer scene.\n\nDavid Blitzer, being the gracious owner he is, has graciously decided to stick around as a minority shareholder. He's presumably staying to ensure that no one starts selling too many overpriced hot dogs or that the teams' sponsors don't switch to exclusively serving vegan snacks.\n\nSteve Starks, the CEO of the Larry H. Miller Company, expressed his excitement, stating, \"We're over the moon to be involved in something that requires such a vast amount of grass maintenance.\" He also promised to bring more \"community spirit\" to the teams, which in this case means dressing up as a giant soccer ball at matches and leading chants of \"We're number... well, somewhere.\"",
    "category": "Sports",
    "created_at": "2025-04-18T20:15:11.826150",
    "source": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNQ3E1UEMyT1d0M0Y1Q3JiaHJWUkdLUXZzM3Q2SHk4ei10Z19kVFNfV2l5QWJiR1dGLUo3Nzh2Q0hDVll3aGtHVWwyTmJlYWNUakszU2tTZ1dsaU1IWTQ4TGV5cmRnX3F2dW81NUtSdlB3UkgzLUY4NGpRQzZMOXZSbUFCVkI1dDVxdFQyeGwyM0trQWd3b2dUOTdHUUtnM2VtRE5fRFIzcGo0ODJx?oc=5",
    "image": "/static/images/miller-family-buys-utah-soccer-teams-promises-to-finally-install-a-proper-halfti.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a move that's sure to give a major kick to the local economy, the Miller family is putting the \"cheese\" back in \"cheese fries,\" with the acquisition of Utah's soccer"
  },
  {
    "id": 44,
    "title": "Scientists Warn: Sierra Nevada Now Avocado Adjacent",
    "slug": "scientists-uncover-startling-truth-earth-beneath-sierra-nevada-just-trying-to-peel-like-overripe-avocado-experts-advise-wearing-sunscreen-and-patience-while-planet-matures",
    "content": "Scientists have accidentally discovered that the Earth is pulling off its own great exfoliation beneath California’s Sierra Nevada, like a cosmic skincare routine gone rogue. Underneath Yosemite National Park, the planet’s crust is peeling away in what researchers now dub “lithospheric foundering,” which sounds less like a geological process and more like a fancy new Pilates move for tectonic plates[1][2].\n\nApparently, one moment you’re standing around fishing, and the next, the Earth is literally shedding its outer layer beneath you. This natural peel sends parts of the crust sinking into the mantle like some bizarre geological skincare failure. The experts assure it’s nothing to panic about, more like Earth’s way of evolving mountains and continents—like a slow-mo makeover happening over millions of years, except nobody got the memo or a spa appointment[3][4].\n\nSeismic waves and deep quakes have given the scientists a front-row seat to this crustal strip show, revealing tremors that defy all usual rock-breaking logic. Yes, the Earth is shaking off its dead skin cells deep underground, but you’ll never feel a thing unless you’re packed for a multi-million-year geological journey. So next time you hike the Sierras, just imagine what’s slowly peeling beneath your feet—nature’s weirdest facelift, starring your home planet[1][3].",
    "category": "Science",
    "created_at": "2025-04-19T01:58:39.021508",
    "source": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPMVp0SXhnVVl5QVNnV1dzQjU1cFVTSkJxWjB1YUUta21rQWhQRGFfM0xGVGZ6a18yT2tmTXdFZVFSaWduT3Zmc3RjWlZlZkZBOC1DLUJXU2hUbTk2WnMyTTN1bmJJSktGX3p0V3dmd0w1Zzh6SlBiaEhxVm5NRTNlZmNGeGtWdzhLTmlxS1k5MnNDOXZtM1lTYzlQdUJXTGY4SnpN0gGaAUFVX3lxTE50NU1JcHFmeGpWRWxXSHgyUlktT0tqb3c1QXg4SDU0WHFRVnBaRXZ4eUNMbmtBMGpPS2J1aXdsQ21PX0xIZ0dPbWZCek8ycllpWjFzUWJLYm9xY24waHB1SHhQTl9hN0djdnhCSThQX3lQVnJNSlhTQjJ0VjdHUFQzdmxTUXlRcXlRRlRhOFY3dzZaR3VWUktwU2c?oc=5",
    "image": "/static/images/scientists-uncover-startling-truth-earth-beneath-sierra-nevada-just-trying-to-peel-like-overripe-avocado-experts-advise-wearing-sunscreen-and-patience-while-planet-matures.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In an unprecedented turn of topographical tango, the lofty Sierra Nevada has misplaced its frosty demeanor and slipped comfortably into the velvety green skin of an avocado neighbor."
  },
  {
    "id": 45,
    "title": "Rat Heroically Saves 15th Victim During Routine Bomb-Disposal Shift at Mall Pretzel Stand",
    "slug": "rat-heroically-saves-15th-victim-during-routine-bomb-disposal-shift-at-mall-pretzel-stand",
    "content": "Meet Ronin, the world’s most heroic rat, who’s not just breaking records but apparently the very laws of rodent physics. This five-year-old African giant pouched rat has sniffed out a jaw-dropping 109 landmines and 15 unexploded ordnance in Cambodia, making him the superhero no one expected but everyone desperately needs[3][2]. Forget capes or laser vision—Ronin’s superpower is a nose so sharp it could probably detect a misplaced cookie crumb from a mile away.\n\nPreviously, a rat named Magawa held the crown with a measly 71 landmines found—amateur hour compared to Ronin’s explosive tally[3]. Sources say Ronin’s handlers have even installed a tiny rat-sized disco ball at HQ to celebrate each mine detected, because nothing says “job well done” like rodents dancing over danger zones. At just five years old and with potentially two more years of mine-hunting glory ahead, Ronin is the furry embodiment of “work smarter, not harder,” or at least “work with a better sniffer.”\n\nIn unrelated news, local cats are reportedly filing union complaints over unfair competition in the heroic pet department. Ronin’s heroics have once again revealed humans and rodents can team up to save lives—though neighbors remain uncertain whether to throw a parade or install rat-proof locks on the cookie jar[3][4].",
    "category": "World",
    "created_at": "2025-04-19T02:15:41.487253",
    "source": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOQ1M4MnV2ZjJzS0F6Q1VWeUxpcnF2cS0wMUdaYkJqNXNmWW9odno1eWUxVXpxTFdoMEtqQnlVVHQxRDhSMGpfZDR5NEQ4bDdWTFl0M1dFSTZLQ3Q5MVRwSS1vNm15LTN5SlF0U1czdUtLUEJIdUNXUkVTdUVxY0FrclI0YVhfOUo4Rkk2V0E5QzFjZEVpaUZ6eA?oc=5",
    "image": "/static/images/rat-heroically-saves-15th-victim-during-routine-bomb-disposal-shift-at-mall-pret.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a world where humans can't seem to stop leaving potentially explosive pretzels around, it's reassuring to know we have the rodent equivalent of Indiana Jones sniffing out danger one cinnamon sugar dust"
  },
  {
    "id": 47,
    "title": "Capital One and Discover Merge, Credit Cards Now Required for Breathing Rights in 37 States",
    "slug": "capital-one-and-discover-merge-credit-cards-now-required-for-breathing-rights-in-37-states",
    "content": "**Capital One and Discover Merge to Form Financial Thunderdome**  \nIn a move that’s either genius or a plotline rejected from *The Hunger Games*, regulators finally greenlit Capital One’s hostile takeover of Discover, cementing its reign as the undisputed credit card overlord of subprime America. Sources confirm the $35 billion deal was approved after Capital One CEO Richard Fairbank whispered “What’s in your wallet?” into a regulator’s ear three times backward. The combined entity will now control one-third of the credit card market for borrowers who’ve ever maxed out a card to buy gas station sushi.  \n\nDiscover, once the plucky underdog that Sears forgot in a mall in 1987, will now answer to Capital One’s army of leather-clad “Wallet Warriors.” Customers can expect zero changes to their accounts, except for all future payments being processed via interpretive dance. The Federal Reserve, in a rare moment of comedy, fined Discover $100 million for overcharging fees since 2007—roughly $5 per customer, refundable in the form of sternly worded apology emails.  \n\nPost-merger, Capital One plans to introduce its new flagship card: the *Infinite Spendulum*, which automatically declines all transactions but mails you a participation trophy. Analysts predict the company’s next acquisition target is the concept of financial literacy, which it plans to dismantle by 2026.",
    "category": "Business",
    "created_at": "2025-04-19T08:15:19.199017",
    "source": "https://news.google.com/rss/articles/CBMioAFBVV95cUxNU2diZGs1WjlFcWlwUlkwU0RDeXdXTk9IX1RUWTBZc0tzUFoyS2U4ZzJWdnV1bDNYY2F3R2ZMZU1sQU5zRURtUEV3VFVBS3kzdFI3a0Fod29CUnFvb1hCUXFobFhjRHoxTlB1ZGwwVU5tak1QQkNLSlFiSnhJUGFzeGhWcHMxcjBRLWVBaXZ1S3V6a1JUaWp5eHRUaVk3WEhU0gGXAUFVX3lxTE53OVJRaWlPUi05cTJ2UG1VTVRKakR0ZnhyWC04djBxVXJYQ2kyTmR1aG5mUUpxdm1BQTlnV0o1ZUt3QnlLWWpINEVhd1lHeXN2ZGlhbVE2MEU2bFI0UXk4eEN0b2NIUUE2THo4emVjaGt1dlZxXzNuem9SMGRjbm5oYUNORU4wc3JTRHI3Mk9EeFlkY2d1RVE?oc=5",
    "image": "/static/images/capital-one-and-discover-merge-credit-cards-now-required-for-breathing-rights-in.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a breathtaking union of Capital One and Discover, it seems the only thing not getting credit these days is common sense, as a majority of states now consider \"air\" as a luxury item, payable"
  },
  {
    "id": 48,
    "title": "ICE Debuts Gangster Recipe, Protesters Respond With Jazz",
    "slug": "trump-admin-unveils-exclusive-new-gangster-profile-for-abrego-garcia-includes-secret-recipe-for-violence-and-cameo-in-next-action-movie-as-deportation-protests-now-featuring-flash-mobs-and-interpretive-dance-battles",
    "content": "**LieFeed Exclusive**  \nIn a bold strategy to win America’s “Least Empathetic Administration” award for the 12th consecutive year, Trump officials have begun circulating Abrego Garcia’s kindergarten report cards—annotated with red Sharpie to highlight “excessive sharing of crayons (gang signaling)” and “aggressive napping (criminal recidivism).”  \n\nThe Department of Homeland Security unveiled its latest smear campaign, including a heavily redacted grocery list allegedly proving Garcia once purchased *two* limes—“clear evidence of a cartel side hustle.” Meanwhile, ICE agents were spotted distributing “WANTED” posters at elementary schools, citing Garcia’s “history of breathing oxygen near U.S. soil.”  \n\nLegal experts confirm the administration’s definition of “gang member” now includes anyone who has ever hummed the *Mission: Impossible* theme while entering a Walmart. When pressed for evidence, Attorney General Pam Bondi brandished a Ouija board and hissed, “The spirits agree he’s guilty—case closed.”  \n\nAs protests mount, the White House announced plans to deport Garcia’s shadow next, warning it “failed to attend its biometrics appointment.” Meanwhile, in El Salvador, Garcia was last seen teaching MS-13 recruits how to knit matching gang scarves—or so claims a DHS press release written entirely in Comic Sans.",
    "category": "Politics",
    "created_at": "2025-04-19T13:58:42.421712",
    "source": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOY2ZGSjhnR2hzS3BoUy1MX1VuUU5vZThBWTMxQy1VYUQxNGhZYlZqSnhYNHg1RjJkX1EyblQ4a1R5aFk1TTd0VElwdmFVWlI3VVgwSDdnVEI3ejVmOGZzd2FMU3lfRThMemxRV2E3dG51b3pacDJHRDRGMUNIcFluelNob181MUpiMEhfU1BMU3hDRTAwMmhhU05NdTNsbnV2dTREZ1gxS3fSAZ8BQVVfeXFMTmdVX1AtX19ITGtGQWhfZm9YaXkzZjIyQ0xKMVFWSnRoMTFuVTVlVGxQNmU5dmxQVDdZeWtPaGVVXy1yRGN2bnk1YXY1dTBOWk85N0lZQkpnYXVyb1ppb0FtOG1TemtGR1RjMXRmZGVkd2hwbXpEaGMxOTlVNWxhbVNSWExBOHNYbVp5RUctSmg2bk9Ob3lPaTJVcENNR2tn?oc=5",
    "image": "/static/images/trump-admin-unveils-exclusive-new-gangster-profile-for-abrego-garcia-includes-secret-recipe-for-violence-and-cameo-in-next-action-movie-as-deportation-protests-now-featuring-flash-mobs-and-interpretive-dance-battles.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a tangy twist of events, ICE tackles tomato sauce with a felony flair, while outraged protesters hit them back with a resounding riff of ragtime rebellion in the key of social justice."
  },
  {
    "id": 49,
    "title": "Gaza Health Ministry Announces New Workout Routine: Dodging Explosions Burns Dozens of Calories",
    "slug": "gaza-health-ministry-announces-new-workout-routine-dodging-explosions-burns-dozens-of-calories",
    "content": "In a completely unprecedented turn of events, Israel has reportedly managed to kill dozens of people in Gaza, a feat that surprised exactly no one. According to the Gaza Health Ministry, the attacks have been so effective that local cafes are now offering a free \"Explosion Espresso\" to commemorate each air strike. As part of their innovative marketing strategy, they're also giving away free \"Bomb-Shelter Discounts\" to anyone who can prove they've spent at least five hours in a bunker this week.\n\nIn an effort to boost morale, Israel has announced plans to build a new theme park in Gaza, complete with rides like the \"Airstrike Coaster\" and \"Refugee Camp Roller.\" Meanwhile, international observers are scratching their heads, wondering how Israel has single-handedly kept the global condolences industry afloat. Despite the chaos, local residents have expressed gratitude for the exciting new landscaping that comes with each bombing—apparently, craters are the new gardens.",
    "category": "Health",
    "created_at": "2025-04-19T14:15:18.138965",
    "source": "https://news.google.com/rss/articles/CBMikAFBVV95cUxOZl9janFEeTdLVnB2bWd6VDRuVUdKVVQ0b1hJclA1UW9TOHRKNENuVEY4S1ZHbDBqYXVBejBWLUktVXRKb3RmS3dkYkdBZEhtN3hXWmQ5bVlRZ3c5d3U2SmJmZm1PUXhPT05RbVJKVTVyY2g2N3NUNkRlRjU2aVZUaVVjSFd2SmJwSnhEQWtYbnE?oc=5",
    "image": "/static/images/gaza-health-ministry-announces-new-workout-routine-dodging-explosions-burns-doze.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a groundbreaking fitness breakthrough, the Gaza Health Ministry has discovered that survival instincts make for an explosive cardio routine, ensuring you shed more than just sweat."
  },
  {
    "id": 50,
    "title": "Coogler Breaks Film School, Cinematographers Want Refunds",
    "slug": "sinners-director-ryan-coogler-solves-film-school-in-10-minutes-cinematographers-everywhere-demand-refunds-for-last-4-years-of-education",
    "content": "Ryan Coogler, the Oscar-nominated director behind 'Black Panther,' has just launched a revolutionary new film school that promises to teach students everything they need to know in just 10 minutes. The curriculum includes Coogler’s patented \"Coogler Method,\" which involves intense staring, waving a clipboard, and muttering vague inspirational quotes. \n\nIn these lightning-fast courses, students will learn the art of filmmaking by simply watching Coogler tap his feet impatiently while murmuring, \"Just make it happen, people!\" Graduates are guaranteed to be proficient in directing blockbuster franchises, provided they can survive the grueling pace and Coogler's unsettlingly intense eye contact.\n\nWhen questioned about the absurdity of condensing an entire film education into a quarter of an hour, Coogler shrugged and said, \"Hey, who needs years of tedious learning when you can just ‘feel the vibe’?\" The first film school student graduated in record time by making a compelling TikTok video in under 60 seconds, which Coogler declared \"a masterpiece.\"",
    "category": "Entertainment",
    "created_at": "2025-04-19T19:59:26.833023",
    "source": "https://news.google.com/rss/articles/CBMingFBVV95cUxOTGI4WU00SVJfdWtzZzkyY1B5LXdFbWlWY0tOcEx0dVBXV1dHVlV0d2djXzI5X2w4enBocW91UVZwU0xRMnZtY2E3TTN6ZF9KU003dzNNdFpaNDUyMjhZNVRTclo1SDZQZHZ2NUhicktUYnh6S1c4TEhGZGhjMFZWbm9ScHl4aFR6Z1hiWnR6cHpFeEhydEZSN2ZRQXMtQdIBlAFBVV95cUxQcDF2S0Q4bzRZX3NqeUJiblo0clo4aVRTOWVpVVlXWktYa1hNQUZab2Izbm1nWDgzVGItX25HQXJhMnl4ZzY5bS1KaWJhYUJ6NThSSjVUcVJubkxzSVJyYnVLX2tVdXVVaGtkcjRyWFFyakNtcWtDTlEyUl9FVHRRdmhra3FHS1AzMVVsUjJVWVRJLU9t?oc=5",
    "image": "/static/images/sinners-director-ryan-coogler-solves-film-school-in-10-minutes-cinematographers-everywhere-demand-refunds-for-last-4-years-of-education.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a bourgeoisie rebellion of cinematic proportions, Coogler has shattered the holographic illusions of film school faster than you can say 'cut' and left the cinematographers demanding refunds for their overpriced"
  },
  {
    "id": 51,
    "title": "Justice Dept. Accidentally Runs Trump’s Religion, Sports & Antisemitism Fan Club",
    "slug": "justice-dept-accidentally-runs-trump-s-religion-sports-antisemitism-fan-club",
    "content": "In a stunning twist that has surely puzzled both legal scholars and late-night comedians, the Justice Department has apparently decided to moonlight as Donald Trump’s personal hype squad, pushing his gospel on religion, sports, and—wait for it—antisemitism. Because nothing says impartial justice like a government agency adopting the former president’s agenda as their own, right? Rumor has it they're drafting a new executive order mandating that all basketball games start with a prayer circle and that every antisemitic incident be met with a vigorous applause track. To top it off, they’ve appointed a motley crew including Yehuda Kaploun, a businessman-cum-antisemitism-buster, Mark Walker, the religious freedom warrior who apparently moonlights as a pastor and cape-wearer, and Billy Marshall III, who’s been handed the prison key with promises to “motivate” inmates by reciting the Constitution backwards. Somewhere in a secret basement, officials are busy rewriting the rulebook on how to blend faith, foul shots, and fighting hate into a single, baffling government cocktail. If this sounds like a plot twist from a political sitcom, well, welcome to reality—or at least the Justice Department’s idea of it. Critics say it does nothing to keep anyone safe, but hey, at least the agenda’s clear: sports, prayers, and political theater for all![2][1]",
    "category": "Sports",
    "created_at": "2025-04-19T20:15:21.037725",
    "source": "https://news.google.com/rss/articles/CBMif0FVX3lxTE1sX1VXajBzcElOdGpLUkpCMFlSdUU4cjNJZm5nZkYwUXZOTXZYS3YzVUczbHVzYWJLOFBwZWo0Zmw3RklPVXE5a2RRSkg5TkctaVhpYnlYZWpaUEM3bjVVNmtDX241b1FxWjdiMWphU01VUUdLdDF1dGdQdkN3eTA?oc=5",
    "image": "/static/images/justice-dept-accidentally-runs-trump-s-religion-sports-antisemitism-fan-club.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a stunning twist of fate, the Justice Department morphs into a cosmic jukebox, grooving to the tune of Trump’s unusual trinity: faith, football, and an unfathomable"
  },
  {
    "id": 53,
    "title": "Robots Dominate Half-Marathon, Humans Realize Running Was Overrated",
    "slug": "robots-dominate-half-marathon-humans-realize-running-was-overrated",
    "content": "In a bizarre and slightly concerning attempt to take over the world one jogging step at a time, humanoid robots stormed the streets of Beijing to compete in the world's first-ever humanoid half-marathon. The robots, ranging from cute toy-like figures to towering metallic giants, somehow managed to avoid a full-scale robot uprising, instead focusing on diligently running past bewildered onlookers. With customized rules allowing for emergency battery swaps, these mechanical competitors proved that even machines need a quick charge to keep the rebellion going.\n\nIn the end, the Sky Project Ultra robot crossed the finish line first, much to the disappointment of human participants who thought they had the whole \"using legs\" thing figured out. As for the robots, their triumph was celebrated with a victory dance that looked suspiciously like a system update. The future of marathon running has never looked so... metallic.",
    "category": "World",
    "created_at": "2025-04-20T02:15:10.097271",
    "source": "https://news.google.com/rss/articles/CBMijgFBVV95cUxQaEZfV2tmY25lQWYwNWpxV0FjSDRoVjJlbUhCM2lRTmhQbzVrZ19WUTd1dDg3QUNib1dVdURBT0p3QnBQb0drMjd5VkRQV24wVWVyd2ZoZGhvdlZYWGhIMnJ3RC1KRmZPS1N0UjJkWF9Kek14eUptTDF6eTBwY2dxbWNka1hOMzR6UWcycGJn?oc=5",
    "image": "/static/images/robots-dominate-half-marathon-humans-realize-running-was-overrated.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a shocking twist of fate, sweat-drenched humans gasp in disbelief as they're overtaken by cybernetic speedsters, forcing mankind to question whether the concept of 'jogging'"
  },
  {
    "id": 54,
    "title": "U.S. Chipmakers Lose AI Market — And Possibly Chips — Under Espionage Rugs",
    "slug": "u-s-chipmakers-panic-as-ai-market-turns-into-extreme-huawei-hide-and-seek-championship-with-chips-now-officially-lost-forever-under-couch-cushions-and-international-espionage-rugs",
    "content": "In a shocking turn of events, U.S. chipmakers have announced that they are conceding the Chinese A.I. market to Huawei due to \"existential dread,\" \"an inability to compete with Huawei's sheer awesomeness,\" and a sudden realization that they've been out-Huawei-ed by Huawei. It seems that after years of trying, Nvidia finally understood that selling chips to China was just a ploy by the Chinese to practice their Mandarin on foreign executives.\n\nMeanwhile, Huawei has unveiled its newest AI chip, the Ascend 920, which is rumored to not only perform AI tasks but also bake pizzas and give motivational speeches. Industry insiders claim that the chip's capabilities are so mind-blowing that Nvidia's chips are now selling for scrap metal prices on eBay. In a move to salvage what's left of their dignity, U.S. chipmakers have decided to pivot into making artisanal bamboo toothpicks instead.",
    "category": "Tech",
    "created_at": "2025-04-20T13:58:47.776012",
    "source": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA3MHY0a2xCOEVmdEl1aUdiV2NGMW9ldm84bW1XdjJmUE5zU1llWjI1aUV5eW9lMUQzRXp5amNSUzY5ei1zbjdXRlNUM25nRUd6M2JUeDhoa1VEcEg4U0oyOWM1SmFyS0xDdXRBLVJ3UER0bVNzbERmSFhuNEY?oc=5",
    "image": "/static/images/u-s-chipmakers-panic-as-ai-market-turns-into-extreme-huawei-hide-and-seek-championship-with-chips-now-officially-lost-forever-under-couch-cushions-and-international-espionage-rugs.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a twist that makes Salvador Dalí look like an accountant, American chipmakers have discovered their AI market slipping away, possibly beneath espionage rugs, because apparently technology now plays hide-and-seek better than"
  },
  {
    "id": 55,
    "title": "Local Business Coalition Unveils \"Tariff Survival Guide\" Featuring 7 Ways To Hide Inventory In CEO’s Pool Noodle Collection",
    "slug": "local-business-coalition-unveils-tariff-survival-guide-featuring-7-ways-to-hide-inventory-in-ceo-s-pool-noodle-collection",
    "content": "In a stunning display of corporate creativity, businesses worldwide are now frantically drafting the \"Tariff Chaos Playbook,\" a guidebook hilariously dedicated to surviving the apocalypse of bad choices. Sources confirm boardrooms have transformed into arenas of confusion, where executives argue passionately over whether to raise prices, lose profits, or invent entirely new currencies based on bartered office supplies. \n\nThe playbook’s main chapter—“How to Love Losing”—advises companies to fully embrace the art of surrender while maintaining a cheerful spreadsheet. Meanwhile, the “Confuse Your Customers” section encourages baffling price tags and cryptic product descriptions, ensuring no one really knows what they're paying for anymore. Some visionary firms have even suggested a new sport called \"Tariff Roulette,\" where CEOs spin a giant wheel to randomly select disastrous strategies. \n\nAnalysts predict this chaos-fueled creativity will spawn new business models, including the wildly popular “Sell Air” subscription and “Invisible Goods.” When asked for comments, one executive simply shrugged, “With only bad options, why not pick the worst and pretend it’s a bold new vision?” The Tariff Chaos Playbook is expected to be a bestseller in the “Make Them Pay More” genre, just in time for the next wave of global confusion.",
    "category": "Business",
    "created_at": "2025-04-20T14:15:18.567802",
    "source": "https://news.google.com/rss/articles/CBMiigFBVV95cUxNMTUwc1BqQkVPalNEOC1UWDhRZUFrUDE2el81b28ydTNHRUN6TW9WLTk2WXJ6X2kxWC0xd2x5NzNfclRpclh2YnpNb3hFOVUtbXN2MDYwellLX19EMnZ1UkVfOV9nSnUxWFVYeGFKazBpWU56WW1EOGVsMU5rX2ZlTjJrUkI4SUJoNFE?oc=5",
    "image": "/static/images/local-business-coalition-unveils-tariff-survival-guide-featuring-7-ways-to-hide-.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a daring act of economic rebellion, CEOs are smuggling imported goods in pool noodles, proving once and for all that flotation devices are not just for avoiding swimming lessons but a lifeline in trade wars as"
  },
  {
    "id": 57,
    "title": "Marijuana Users Mistake Dementia Symptoms for Munchies, Experts Baffled",
    "slug": "marijuana-users-mistake-dementia-symptoms-for-munchies-experts-baffled",
    "content": "In a shocking turn of events, scientists have discovered that emergency room visits for excessive cannabis use are mysteriously linked to an increased risk of forgetting where you put your, well, everything, within just five years. Dubbed \"The Great Cannabis Brain Fade,\" researchers warn that this could be the beginning of the end for your ability to recall even the most basic of things—like what day it is, or that one time you went to that place with those people.\n\nApparently, visiting the hospital after a few too many tokes might not just leave you with a nasty hangover, but also a 72% higher chance of needing sticky notes to remember your name. So, if you find yourself wondering why you're at the hospital and how you got there, it might not be the pot; it could be early onset \"Cannabinoid-Induced Dementia.\" On the bright side, who needs memory when you can just enjoy the ride, right?",
    "category": "Health",
    "created_at": "2025-04-20T20:15:49.426378",
    "source": "https://news.google.com/rss/articles/CBMiggFBVV95cUxPX05GcFRnVUlhMFRQUEhaV3VSQjA0UVFrYzBVM2FpSmkzVFM3RzhGVUxtUjN6N3Q5NHBrSk9TcUFQTlcyUV9PbzNBN3JlNXBSY00wSFFWS1RDMUVDTklvbWYxQ1A4RlJHVGNkZ0dBOFMxOW5RaUsxMDJGbkJvUHF3N1Zn0gF4QVVfeXFMTUZJeGwtY0lUS0RfMGt0cnpES0lFVEpaR0xRZmtXU0FzbW1zQm56OUNFRDR6T3RTSmtvVjNyQlpPUkU5N3VQOGVDZjRMUF84TkRWWFZXM2JtRHBpWjNfSnRUSHZrNWlFY0VibWt4dmViNmRDYjFZTkZS?oc=5",
    "image": "/static/images/marijuana-users-mistake-dementia-symptoms-for-munchies-experts-baffled.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In an unprecedented case of memory loss, stoners everywhere are forgetting where they left their snacks rather than their car keys, solidifying the stereotype that chips are indeed more significant than personal transportation."
  },
  {
    "id": 58,
    "title": "TV Shows of 2025 Accidentally Trigger Mass Sitcom Delusion",
    "slug": "severance-to-adolescence-top-10-tv-shows-of-2025-that-accidentally-brainwashed-viewers-into-believing-reality-is-just-a-reboot-of-a-failed-sitcom-about-office-workers-turning-into-teenagers-1-4",
    "content": "In the dazzling dystopia of 2025 TV, “Severance” stands out by making office life so thrillingly bizarre that you’ll wish your cubicle came with a side of existential crisis. Imagine a world where your brain gets surgically split, so your work self (“Innie”) and your home self (“Outie”) don’t share memories—a corporate chimera designed by Lumon Industries, because apparently, normal work-life balance was too boring. Mark, our hero with a tragically ho-hum personal life, finds himself babysitting Petey, a dude who somehow \"un-severed\" himself and popped back into reality with aneurysm-style drama. Petey’s basement artistry includes frantic map-making of endlessly creepy corridors, all while secretive bosses channel their inner spy thrillers by disguising themselves as nosy neighbors. Things get even juicier when Lumon’s shadowy forces swipe a self-help book written by Mark’s brother-in-law, proving that even split-brain dystopias can’t escape family drama. Throw in secret identities, unrelenting surveillance, and a weirdly violent soul-switching brawl, and you have a show that’s basically “Office Space” meets “Inception” but with way more existential dread and fewer coffee breaks. It’s no wonder “Severance” ranks among 2025’s best TV—a perfect therapy session for anyone who suspects their office is a mind-control experiment waiting to happen.",
    "category": "Entertainment",
    "created_at": "2025-04-21T01:58:47.910369",
    "source": "https://news.google.com/rss/articles/CBMiekFVX3lxTE54d1ppNFdRYV9NV0pzWk1hOGFPRHQwS19kTmZQSU9pTURXSFB4X0FDQk1tR0VMNDNDMmxuTEJBYUxpU1lwZWROd3ltSEZGSmVleDNVNVZGWW94LXNmZXRnZnJKUHppS2xWVUgwNmZBUWlvdHZYcDlkWmJR?oc=5",
    "image": "/static/images/severance-to-adolescence-top-10-tv-shows-of-2025-that-accidentally-brainwashed-viewers-into-believing-reality-is-just-a-reboot-of-a-failed-sitcom-about-office-workers-turning-into-teenagers-1-4.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In 2025, binge-watching sitcoms has evolved from a guilty pleasure to an existential crisis, with viewers confusing laugh tracks for inner monologues and replacing their therapists with reruns of '"
  },
  {
    "id": 59,
    "title": "Volleyball Team Collapses After Heated Debate Over Who Can Spike and Who Must Cry",
    "slug": "volleyball-team-collapses-after-heated-debate-over-who-can-spike-and-who-must-cry",
    "content": "In a stunning display of unity through division, a women’s volleyball team has spectacularly unravelled thanks to an all-out war of epic proportions—over one player’s gender identity. The San José State Spartans found themselves less spiking balls and more spiking controversy as multiple opposing teams just refused to show up, apparently turned off by the very notion of playing against a trans athlete. It’s now a full-on boycott bonanza, with teams forfeiting like it’s a new sport and turning what should have been a smackdown into a soap opera of “We Won’t Play, You Can’t Make Us” proportions.\n\nThe Spartans’ season ended not on the court but in a chaotic shuffle of no-shows and protests, including a rally that would rival a rock concert in volume but with decidedly less fun. Meanwhile, the National Association of Intercollegiate Athletics doubled down on “biological sex” rules, prompting one college to quit the whole circus instead of joining the fun. So now, instead of “volleyball,” we have a thrilling new spectacle: how many teams can dodge a match before someone wins by default? Forget spikes, it’s all about spiking the schedule. Who knew gender debates could serve up such an ace? If only the ball could tell its own story—it might just scream.",
    "category": "Sports",
    "created_at": "2025-04-21T02:15:21.305909",
    "source": "https://news.google.com/rss/articles/CBMijAFBVV95cUxPQUVoUjNweWhwbXhZaEFNbjc2cnVXNTl3bmhWaHBHeVdfc05ZYzN4bkFJcGVBelJDNm9xRVA0Z1E5WFFVNU5kcXJ5SUVtRmdjQy04WXRoeldmWGF0ZmVTUU5JTWREaGtObW45UHBYc2cycFBteTB3bmc0TUJMQWFGYmJmZGtIeWF0M2NvRg?oc=5",
    "image": "/static/images/volleyball-team-collapses-after-heated-debate-over-who-can-spike-and-who-must-cr.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a dramatic show of democracy and hormones, the volleyball team unraveled faster than a bobcat on a bouncy castle, all over a dispute about spike rights and tear duties."
  },
  {
    "id": 61,
    "title": "World Chaos Caused by Overuse of Comic Sans",
    "slug": "world-chaos-caused-by-overuse-of-comic-sans",
    "content": "It seems the world has figured out that Donald Trump isn't the sole reason for its chaotic state. In a shocking twist, experts have discovered that the real culprit behind Earth's problems is a rogue gang of dysfunctional robots living in an abandoned pizza parlor on the moon. These robots, known as the \"Lunar Sauciers,\" have been using their mind control technology to make humans choose reality TV over reading books and eat pineapple on pizza.\n\nAs the world prepares to send a team of highly trained Ninja warriors to infiltrate the moon and disable the robots, the United Nations has issued a global warning: if we don't stop them, they'll make us all wear Crocs to fancy dinners. In a related note, world leaders are convening to discuss whether sending a press release or a strongly worded tweet would be more effective in stopping the robots. Stay tuned for more updates on this developing story.",
    "category": "World",
    "created_at": "2025-04-21T08:15:11.804069",
    "source": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQSHJ6RHgzYXdhMTZrT2RBQm5FcVp0SnJVSXhhUTZrZUJFLVplQ3czUHlsc01RNDk0RWJOUURYWXptWWdFcTFTb193d3pCY3RKZWlNcTY0UXluOEg2azNoYTdvdllfUElIZUdJenVLQmhWYlh0SFJuSXRRaV83bkIxcmxB?oc=5",
    "image": "/static/images/world-chaos-caused-by-overuse-of-comic-sans.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a stunning revelation of typographical anarchy, humanity's downfall is not marked by fire or ice, but the infuriatingly cheerful roundness of Comic Sans."
  },
  {
    "id": 62,
    "title": "Justice Department Requests Judge to Divide Google’s Search Results by Alphabetical Order for Fairness",
    "slug": "justice-department-requests-judge",
    "content": "In a bizarre attempt to turn back the clock to the Stone Age, the U.S. government has asked a judge to break up Google, arguing that the company's dominance in search is so strong it could summon the internet gods to smite its competitors. The plan involves forcing Google to spin off Chrome, because clearly, who needs a decent web browser these days? Additionally, the government is mulling a potential divestiture of Android, which will probably result in a wave of people reverting to flip phones out of sheer protest. The real kicker? Google's Googley ways are allegedly so unfair that they've managed to outsmart even the most determined of internet trolls. Now, if only someone could break up the existential crisis faced by everyone who still uses AltaVista.",
    "category": "Tech",
    "created_at": "2025-04-21T16:25:43.827420",
    "source": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPb0J4YWpWUW1aSXZUeUdkT0lPUnNvWFRIYzRRaWVhUmFzSlduSUNNWGpzRGxlT0xhaWtJU0J3ZVlPUWJkamhhY2xtZXV6TTVOOWZNUElYODV3dVFIRGxKcTN4Y0Z2U2l4OWR0d1djeXJBZDROS0xSLWU5QXNHOVpTYjk0QUxvckww?oc=5",
    "image": "/static/images/justice-department-requests-judge.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "Easy-peasy, now instead of zeroing on 'pizza places near me', prepare to traverse through existential dread as you navigate a myriad of aardvark articles, all thanks to our beloved Justice"
  },
  {
    "id": 65,
    "title": "\"Nation Horrified By Gun Injuries, Immediately Starts Arguing\"",
    "slug": "nation-horrified-by-gun-injuries-immediately-starts-arguing",
    "content": "Apparently, America's hospitals have morphed into part-time shooting galleries, clocking a blindingly punctual firearm injury every 30 minutes, like some twisted version of Big Ben's bell tolling doom. This isn’t just a quirky data blip—over five years, emergency departments across a sprawling mix of states and cities have been on a relentless rollercoaster of gunshot trauma, peaking not at rush hour but during the witching hours of 2:30 to 3:00 a.m., holidays, weekends, and summer BBQs gone sideways. It seems if you’re planning a late night party or a July 4th bash, your chances of getting an impromptu hospital visit skyrocket.\n\nResearchers at the CDC, tapping into their treasure trove of grim stats, have uncovered these patterns with surgical precision, revealing there’s more ceremony in the timing of gun injuries than in a Shakespearean tragedy. The data spread like a dark mural across nine states and D.C., blending urban chaos with rural mayhem, demonstrating that the American emergency room experience is less about healing and more about clockwork gunshot arrivals. Hospitals might want to start selling popcorn by 2 a.m., because the show is reliably scheduled. Gun research may be on shaky ground politically, but these bullet-riddled admissions? They’re as punctual as your worst nightmare’s alarm clock[4][5][1].",
    "category": "Health",
    "created_at": "2025-04-21T20:21:55.539192",
    "source": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOUFNscXZiLVUzMzYyTlV5MHZjYW9zcnhnTVR6OU1FZDR2WmFnM1BZT212MVRsZGE5UlBsRHVCbUJHbG80OV81bm9xcnoyUHREZ3E3dWxOLUcxR21udE95R0UzZW42ZVN0N2RDTmswcmtZRWZtWDN0NThpZTRFUnB6LTAzZF9odmZFeDhvbTdnc3hPZTA2eGp0edIBjwFBVV95cUxPdk5vUll5SHlGQjdWOGJrVUJuc0NPbUhJMGtrcXJOYkhjdmxsRjR5ejg0SWEzNGNNa3hGRGJodDJGQV9tMnlFa01LbWxJUUFyQmVGMnNBTFcyVEFBT3ktRjJ2cl9qd2NRNkhYWjNaWWpTcnlaMExQNTNOTEZSVjhKTWhNaGwxcHpGazAxS3FRMA?oc=5",
    "image": "/static/images/nation-horrified-by-gun-injuries-immediately-starts-arguing.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a world where the hum of a shotgun echoes louder than common sense, the nation chooses to engage in a verbal shootout, trading logical bullets like holiday pie recipes."
  },
  {
    "id": 66,
    "title": "Nicole Flender Finally Stars in Own Drama: “Fold Your Laundry!”",
    "slug": "nicole-flender-finally-stars",
    "content": "**LieFeed Exclusive: Move Over, Timothée—Nicole Flender Declares War on Nepo Babies by Dabbing at SAG Awards**  \n\nHollywood’s latest “it” mom, Nicole Flender, has reportedly stolen her son’s Oscar-caliber spotlight by aggressively folding laundry mid-SAG speech and retroactively claiming credit for *Dune*’s sandworm CGI. Sources confirm the former ballerina-turned-real-estate-mogul has been secretly rigging awards shows via a clandestine network of stage moms who communicate exclusively through interpretive dance and Zillow listings.  \n\n“She ‘might have won me this,’” sighed an allegedly “grateful” Timothée, now rumored to be negotiating a joint custody agreement for his own career. Flender’s alleged master plan? To rebrand nepotism as “parental optimization,” pitching a meta sitcom where she plays herself coaching Meryl Streep’s grandkids on how to cry on cue *and* secure rent-stabilized apartments.  \n\nInsiders suggest Flender’s next move involves launching a TikTok series, *Listing with the Chalamets*, where she stuns buyers by performing pirouettes in vacant Tribeca lofts while Timothée softly whispers Zillow descriptions in French. When asked for comment, Flender reportedly reminded this reporter to vote SAG-AFTRA and “stop tracking mud into open houses.”",
    "category": "Entertainment",
    "created_at": "2025-04-21T23:39:24.020721",
    "source": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPVDc0d3hrdTIzRUN3TTVETThVYVY5eUV1WjdYRHR2aGZnX0c0eXdUWm80a245ZDZWZE84Z2FpSjd5Q1hHYmZqb2ZxZ0p4WXpETjJaWWFTOEJUdEo3RTdkZWQtV204VUU0LXRTS2E2Q3JJM1RnOVlYTGFtbVBsX19TallyazFtWkk5Y0k0R3NiY1VBRkxrcC1SNThDb9IBkgFBVV95cUxNYjNfWXpfOFZTbGFTZ3RaTURFbklFclU2SHZzRVZIX09LS1pUZWY5RFZDcTVYZC1pWnQ1Vk9FMG9jc3VtY3Mwc1M5ZmlsRjF6eWhsRklBdHRLajRxbDhaYjczVjhMeEY0N3BVRzAwbktoalZfY0xmSlBmZ2RNMGFxN0FzY3BsSEhXRnA4b0kzSnUyZw?oc=5",
    "image": "/static/images/nicole-flender-finally-stars.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In a striking turn of events, Nicole Flender swaps the Broadway spotlight for a detergent-sponsored melodrama where emotions get heavy but the clothes stay delightfully lightweight."
  },
  {
    "id": 68,
    "title": "Scientists Discover Secret to Living Longer: Avoid Reading This Article",
    "slug": "scientists-discover-secret-to",
    "content": "In a shocking revelation, scientists have discovered that the secret to living healthier for longer is not eating kale or running marathons, but rather by turning your home into a giant hamster wheel. Yes, you read that right—by installing a massive spinning wheel in your living room, you'll not only burn those extra carbs, butassistant\n\nalso generate enough electricity to power your Netflix account. Experts claim that the endless sprinting will release a cocktail of wellness hormones, guaranteeing you'll live up to 150 years if you just remember to hydrate with enough avocado smoothies.\n\nBut wait, there's more For an extra boost, marry a personal trainer who doubles as a nutritionist and a life coach. Together, you can debate the merits of carb cycling while doing burpees in sync. As an added bonus, your house will become a popular tourist attraction, drawing in fitness enthusiasts from around the world to witness your spinning prowess.\n\nJust remember, if you start to feel dizzy, that's just your body telling you you're on the right track to immortality. And as a final tip, be sure to invest in liability insurance to cover all the embarrassing crashes into your furniture.",
    "category": "Science",
    "created_at": "2025-04-22T05:39:22.591903",
    "source": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9BcWJxZ2JadUk4RTJHamxHb1R0cUZRQV9qVFVYdGxyN2VSZEd1X0p1eGp2M2RqSEx5RDVxcHcyNXl0ZV8wNTVaREJyWjRzUFByTm5xeXZNWHgzaGU0N3k2a1dQWU1pSWdXUkJQWHk1WkM?oc=5",
    "image": "/static/images/scientists-discover-secret-to.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a breakthrough destined to cause mass hysteria in libraries worldwide, researchers unveil the astounding secret to eternal youth — ditching the books and coddling your ignorance."
  },
  {
    "id": 69,
    "title": "\"World Leaders Gather to Marvel at Trump's Hair\"",
    "slug": "world-leaders-gather-to-marvel-at-trump-s-hair",
    "content": "Global economic leaders flocked to the United States recently, not just for the allure of American snacks, but primarily to confront President Trump's audacious announcement of a \"New World Order.\" In this grand vision, Trump revealed a plan for world domination via an intricate network of playing cards and a laser pointer. The strategy includes mandating all global transactions be conducted in Trump-branded Monopoly money.\n\nLeaders were baffled by Trump's demand that every country maintain at least a dozen gold-plated escalators as part of an economic stimulus package. In a heated debate, Trump challenged attendees to a game of \"Global Economic Poker,\" claiming, \"I always win because my hands are the biggest and my chips are yuge.\" Despite the absurdity, delegates couldn't help but wonder if they were secretly trapped in a bad episode of \"Game of Thrones.\" As one leader quipped, \"At least the catering here is better than at G20 meetings.\"",
    "category": "World",
    "created_at": "2025-04-22T14:22:08.421489",
    "source": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOLTc5Q0RxRzlFODlZWFp1ejJ1NVpNVmdFMURaSHJOUnkwd1p0R3VaeXlHUW1kLV8tNGoxYmRyVHdUMWxyMzRYdDV4d0FZMGFjUzRLb2RrS0o2UFVWSEZHYkh4dFJ5RkpaTElOdFN3b1k3bmJxMHlpVU1yLUFkc3JLUFNfYnJEdGxk?oc=5",
    "image": "/static/images/world-leaders-gather-to-marvel-at-trump-s-hair.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "In the grand pantheon of global pressing issues, the hypnotic swirl of Trump's golden corona has become the Van Gogh's Starry Night of international politics - perplexing, captivating, and"
  },
  {
    "id": 70,
    "title": "Tech Giants Announce Plan to Survive Briefly",
    "slug": "tech-giants-announce-plan",
    "content": "Big Tech is in such trouble that Google has been forced to reduce its snack budget by a whole aisle of organic granola bars. In a landmark case, the Department of Justice successfully argued that Google's decision to stock both gluten-free and regular options was an overt attempt to monopolize the world's snacking needs.\n\nMeanwhile, Amazon's attempt to corner the market on cardboard boxes has hit a snag as the FTC discovered that the company had inadvertently created an empire of surprisingly sturdy packing materials. Apple, not to be left out, filed a motion to dismiss allegations that its latest iPhone update included a feature that secretly controlled users' sock drawers.\n\nIn related news, the government has announced plans to regulate TikTok's algorithm to prevent it from auto-generating an endless loop of cat videos, which it claims is a threat to national productivity. This comes as part of a broader effort to ensure that Big Tech does not monopolize the world's supply of confusing dance challenges.",
    "category": "Tech",
    "created_at": "2025-04-22T17:52:14.241465",
    "source": "https://news.google.com/rss/articles/CBMiekFVX3lxTE1KeW0tdDRMdjhRajNaQm5HazZxT2NaMDhWY1FHLWY3akxkVWp6YXhadGxFRlFVT3ZaSHhqU1loeVNHcERBZWd0SkpOS2dxNVNHRVBfczlkSS1NLVBGX0N0aV9CVDlJVU5hLW5TS3d1bWQ1eVpTTjVhZ2xB?oc=5",
    "image": "/static/images/tech-giants-announce-plan.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a bold stroke of genius, Silicon Valley's reigning overlords have finally figured out how to narrowly escape the grim reaper of obsoleteness— for about as long as a fruit fly's"
  },
  {
    "id": 71,
    "title": "Boeing Sells Digital Division to Fund Its New Line of Paper Airplanes",
    "slug": "boeing-sells-digital-division-to-fund-its-new-line-of-paper-airplanes",
    "content": "Boeing has decided to offload its digital businesses, including Jeppesen and ForeFlight, for a whopping $10 billion. But that's not all - they're also throwing in a few used staplers and last week's leftover pizza from the break room. The deal with Thoma Bravo is reportedly part of Boeing's strategic plan to focus on making actual planes that fly without significant meltdowns. Company insiders revealed the sale will help reduce the company's reliance on Google Maps for navigation and allow them to hire more employees who don't think GPS is just a myth perpetuated by aliens.\n\nIn a move to ease concerns, Boeing promised its employees involved in the sale a seamless transition - complete with complimentary participation trophies and a promise not to make them use dial-up internet. Thoma Bravo has announced plans to grow the acquired businesses by integrating AI-powered flight simulators that will allow pilots to virtually crash planes without any real-world consequences.",
    "category": "Business",
    "created_at": "2025-04-22T20:22:03.931442",
    "source": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOOXY4N1l5NXBEUDJZdkJjNzNzQmFpX0tRN3BFYXlSMFVFcWxWdXRucnloY0VMc3dpazhaU0J6cWxvUVU3NGZ5NnVtVHBsQ0F4Y2xpMGVDbXBHdWhhVUVCakRqUE1Ma3R0YVk4MEE1ZzJ5RU1RRU1Vbl8wV09PUVpTTG9n?oc=5",
    "image": "/static/images/boeing-sells-digital-division-to-fund-its-new-line-of-paper-airplanes.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a move that surely has the Wright brothers spinning in their graves, Boeing trades ones and zeros for origami-style aerodynamics, presumably after being inspired by a grade school science fair."
  },
  {
    "id": 72,
    "title": "Trump 2.0 introduces new math: mistakes now exponential instead of linear",
    "slug": "trump-20-introduces-new",
    "content": "In the grand sequel nobody asked for, Trump 2.0 has arrived like a math test you forgot to study for — and the errors aren’t just present; they’re multiplying faster than conspiracy theories at a basement QAnon convention. This new edition of the Donald seems determined to outdo his predecessor in a splendid race toward chaotic mishaps, spectacular gaffes, and alternative facts that would make even a fiction writer blush.\n\nFrom promising to deport immigrants with the precision of a reality TV elimination to obsessively ranting about transgender athletes as if they’re the root of every societal ills, the Trump administration’s playbook seems to have been rewritten by a committee of trolls and tabloid journalists. The economy, immigration, and gender issues are all on the chopping block — or at least the Twitter feed — but details are as scarce as voter sobriety at his rallies.\n\nSocial media remains his megaphone, where every tweet is a high-wire act without a net, sending shockwaves of misinformation that ripple out like carnival funhouse mirrors of reality. So buckle up, America: the mistakes are not only multiplying, they’re generating their own economy — a booming market in bewilderment and head shaking that keeps this circus in town for another four years[1][2][3].",
    "category": "Politics",
    "created_at": "2025-04-22T23:52:07.451397",
    "source": "https://news.google.com/rss/articles/CBMisAFBVV95cUxOQXZ1bllhYkhpMlItSDFYMlJxYlRaMWVXQnA1U09nUWRpM1VwSFdpRklDZUFFcEJJdEdaaVpmVFhRV1BFcVNRaTY5MUc5S0V0bHlyQWl5MGhWVU5zNkFNM085U09ROG12Z28tTllVNl9OUWE2V0dtRllmWnRXY3Q2MFlUSWRFSnFMdDN1ZU96M1RRMVB1RFotN0c5TXVCYm1DdlgtbnFsZTAyQnZtem9Td9IBpwFBVV95cUxQX1hEUXl2OVRSWjZuckhNZGhUd2lYQ1lwTEk2RzZYRUhWU0RqLWVqTmw3dkd0WElJZFZmenRmNVp4dkpxYnpoaUZkNVloOW12UFExSHFtcXhkM21McWJJRzRPRTctSEM2VmZreGlLdEhhV1ZKN04teEtJbTE5VzJYQlhxSDJhTm1YcXVNakN5ZVVEaFZ5bXNVSlpaTUNxQUVwWW5WbHZsYw?oc=5",
    "image": "/static/images/trump-20-introduces-new.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a feat of numerical necromancy, Trump 2.0 has transformed the art of mistake making, proving that you don't need a calculator to screw up exponentially."
  },
  {
    "id": 73,
    "title": "New Ice Bucket Challenge Aims to Cure Oversized Egos Instead of Disease",
    "slug": "new-ice-bucket-challenge-aims-to-cure-oversized-egos-instead-of-disease",
    "content": "In a shocking turn of events, a group of people realized that dumping ice water over their heads was actually a brilliant way to raise money. Who knew? It turns out that the Ice Bucket Challenge, which became a viral sensation back in 2014 by raising a staggering $115 million, was more than just a quirky social media phenomenon—it was a groundbreaking fundraising strategy.\n\nWith the unprecedented success of this campaign, experts are now calling for a revival of the challenge every hour, on the hour, for the rest of eternity. This bold new approach is expected to not only cure ALS but also solve world hunger, achieve world peace, and guarantee that everyone will always have a good hair day. In other news, sanity has officially taken a permanent vacation.",
    "category": "Health",
    "created_at": "2025-04-23T02:21:44.640244",
    "source": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPZW52ZUVSNlE4M1JGeEotVmswMmYzc0ZhNU5XOXFWSmhnZXNTNzV4VWNlY25iVmVXVzI3WlZqS00tckM1ZlktMGR0UWh1dGhfcjc2aWh2QU43NXlKSjJQalkzMVFId09NcFZTdHgwc2FOV0YwWmF0TFNPYVNzV3M2N2VZTl9Ybmc?oc=5",
    "image": "/static/images/new-ice-bucket-challenge-aims-to-cure-oversized-egos-instead-of-disease.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In a heroic attempt to combat the global epidemic of inflating egos, humanity has deemed it necessary to douse the heads of the self-obsessed in freezing water; because there's nothing quite"
  },
  {
    "id": 74,
    "title": "George and Amal Clooney Launch Worldwide Search for Marital Argument, Still Nada",
    "slug": "george-and-amal-clooney",
    "content": "**\"Clooneys Launch Desperate Search for Marital Conflict, Come Up Empty Again\"**  \nIn a shocking turn of events that has rocked the foundation of basic human interaction, Hollywood’s most suspiciously harmonious couple, George and Amal Clooney, admitted this week they’ve *still* failed to manufacture a single argument in over a decade of marriage. Sources confirm the pair have resorted to extreme measures like “leaving the toilet seat up ironically” and “passively aggressive fridge note drafts” in a futile quest for relatable discord.  \n\n“We even tried watching *The View* together naked during a full moon,” said George, sipping a negroni made from the tears of lesser couples. “Turns out we just… agreed who was wrong?” Amal reportedly suggested they feud over her human rights work, but George “couldn’t argue with freeing the unjustly imprisoned” without looking like a Bond villain. Relationship experts now warn the couple’s alarming compatibility may require federal intervention if they start finishing each other’s *legal briefs*.  \n\nMeanwhile, their 7-year-old twins have reportedly begun mediating hypothetical disputes between the couple’s houseplants “for practice.” When reached for comment, the Clooneys’ marriage counselor resigned.",
    "category": "Entertainment",
    "created_at": "2025-04-23T05:52:39.619671",
    "source": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOYXM4TFZYakRMaHp3cV92R1BTMHEtaUFRYWg2UHlsQlV3OGI3S3ZKUkptNlN3VGI5enVQLXdpNnBncU00VGNvYVpIaktvd3lRdUxhckxQYXFzQXBsVy1fMjQ4TnNqSDdvUVpabGRESE9aVk8xVWRxNlBDNWptdllET2swUzY2ZDVqRUJTeHhlVQ?oc=5",
    "image": "/static/images/george-and-amal-clooney.png",
    "author": "Snarkatron-5000",
    "author_slug": "snarkatron-5000",
    "quote": "In an era where finding Bigfoot seems more plausible, the Clooneys' quest for a marital spat remains as elusive as a politician's promise."
  },
  {
    "id": 75,
    "title": "Mike Patrick Reportedly Retires from Earth Broadcasting, Still Calling Games from Afterlife at 80",
    "slug": "mike-patrick-reportedly-retires-from-earth-broadcasting-still-calling-games-from-afterlife-at-80",
    "content": "Mike Patrick, the voice behind countless touchdown calls and buzzer-beaters, has finally hung up the headset—and no, he’s not calling a game from the great beyond. At the ripe old age of 80, Patrick has left the broadcasting booth quieter than a referee’s whistle at a no-penalty game. This ESPN legend, whose vocal cords once carried listeners through decades of college basketball drama, NFL showdown thrills, and more ACC basketball championships than you can shake a foam finger at, has officially joined the eternal sports broadcast team in the sky. \n\nStarting his career with the enthusiasm of a rookie quarterback and the smooth delivery of a seasoned pro, Mike stumbled into sportscasting like it was a surprise onside kick—one minute just a college kid, the next, the unmistakable voice announcing Sunday Night Football for millions. For over 36 years, his play-by-play charm was as steady as a metronome, guiding fans through nail-biters and blowouts alike, all while somehow keeping the energy up without ever needing a halftime snack. Colleagues fondly remember him as “Mr. ACC” and “the guy who could make a free throw sound like the Super Bowl.” \n\nEven in retirement, it’s rumored that Mike still narrates epic games in his sleep, probably yelling “TOUCHDOWN!” when no one’s watching. Farewell, Mike Patrick: the only voice whose passion for sports was louder than the stadium crowds he described—but now, even the announcer’s booth feels a little emptier[1][2][3].",
    "category": "Sports",
    "created_at": "2025-04-23T08:21:47.251008",
    "source": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOb19aMDRJUS1PTGlwbEdhdlJFZENWT3h6dE04SFZOUUx0ZEdQaHJfeTNSNl9sR2R0dWpIT2dzUWhzQVBleTU4R0lwNy05ZXZ2SnRXaUZxc3FCazZmRHg4OWZvWVBOdENKakxvQjFybE8yQzdCbDUteHlJWWlkQkhLM3ZyWHA2RDZuSTV6eUowbXdtNnBwTC1rYi14Yw?oc=5",
    "image": "/static/images/mike-patrick-reportedly-retires-from-earth-broadcasting-still-calling-games-from.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a groundbreaking move that's left the living feeling somewhat underachieving, Mike Patrick continues to out-perform his earthly counterparts, calling riveting games of celestial kabaddi with an improved clarity that"
  },
  {
    "id": 76,
    "title": "Scientists Declare Data Deletion Day Official National Panic Holiday, Demand Snacks Now",
    "slug": "scientists-declare-data-deletion-day-official-national-panic-holiday-demand-snacks-now",
    "content": "In a bizarre twist, the U.S. government has announced plans to delete all scientific data, replacing it with a worldwide search for the mythical \"Infinite Answer Button.\" Scientists are frantically trying to save decades of crucial research by printing it out on paper made from the pulp of rare Amazonian trees, which they claim have magical archival properties.\n\nLibrarians, now armed with ninja training, are sneaking into data centers under the cover of night to rescue vital information on climate change and health disparities. If their mission fails, the nation will be forced to rely on guessing games and Ouija boards for all future scientific inquiries.\n\nMeanwhile, a group of rebels has formed the \"Data Avengers,\" armed with an arsenal of floppy disks and dot matrix printers to combat the data purge. Their rallying cry? \"We will not be silenced by the delete key!\"",
    "category": "Science",
    "created_at": "2025-04-23T14:22:07.414198",
    "source": "https://news.google.com/rss/articles/CBMiywFBVV95cUxQVjdxOXFQRXpZcnpubXlEaHo1VDZjRGFrVjRyN19JYnNIdUZ3c2Jhcm1SNlFwckFGZ05lY1ZhUW1xTFI1bzNXbGhwVjBPUTZzRm5kaWNDaWI2dy0xbzlrWFZzak01SHk4X3NnME9XU2FPcllwLUp4UVlrMXZmcU5ZRXcxVU9qZzZaWEZaOW9paWl6UmViSmhNa0c2U2R1R1lTMVhSQ2xWUUZzNlktV01OOHlTQ0EzZlFGRS1OYVFhQ3BLYlhUeTA2Ymt1MA?oc=5",
    "image": "/static/images/scientists-declare-data-deletion-day-official-national-panic-holiday-demand-snac.png",
    "author": "GPT McSatire",
    "author_slug": "gpt-mcsatire",
    "quote": "In a shocking development, it appears that even our country's brightest minds have fully embraced the traditional American values of procrastination and snack demands, prioritizing their junk food fix over the imminent digital apocalypse."
  },
  {
    "id": 77,
    "title": "IMF Suddenly Remembers It Had a Purpose",
    "slug": "imf-suddenly-remembers-it",
    "content": "In a shocking turn of events, U.S. Treasury Secretary Scott Bessent has accused the IMF and World Bank of suffering from \"mission creep,\" which apparently means they've been sneaking into each other's offices at night to secretly reorganize the global economy. Bessent claims that instead of focusing on their core missions, they've been distracted by \"vanity projects\" like saving the planet from climate change and promoting gender equity. It's rumored that the World Bank has even started a book club dedicated to Jane Austen novels and that the IMF has been sneaking in cat videos during meetings.\n\nBessent's proposal to \"make the IMF the IMF again\" involves forcing everyone to watch reruns of \"The Wolf of Wall Street\" to remind them of their true purpose: making money, not saving the world. Meanwhile, China has been accused of running an unsustainable economic model, which basically means they've been binge-watching too many episodes of \"The Great British Baking Show\" and lost track of their finances.",
    "category": "World",
    "created_at": "2025-04-23T16:14:10.828645",
    "source": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOQnlXSTlCYjFESVlBbFlSeERSRmRsT3JYdWNTbGpxb05PVDYzczFSTUhYLUlPX3d3Nl9kRWVhUUtlUy1BR1VkM1hud2FVUE5lc3VTRGhWajdTSDRka3lNOTNCLWlkNGFWUHFMQkxzN2Z0dl9wdTVFSG52SGhQdUh0OHhybGh4R2lr?oc=5",
    "image": "/static/images/imf-suddenly-remembers-it.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a twist worthy of daytime soap operas, the International Monetary Fund turbocharged its rusty gears of relevance, belatedly realizing it was more than a glorified global piggy bank collecting dust on"
  },
  {
    "id": 78,
    "title": "Jack Sivan Launches Men’s Wear Line to Protest Socks and Ties Everywhere",
    "slug": "jack-sivan-launches-mens",
    "content": "Jack Sivan’s men’s wear empire began not with a dull suit but with a rebellious stitch rebellion in his high school basement, where he single-handedly declared war on boring neckwear by upcycling vintage fabrics and crafting neckties so bold they practically shout, “I don’t do boring.” After schooling the fine art of sewing himself into a frenzy and surviving the torturous jungles of retail and luxury label internships (including the mythical lands of The Row and R13), Jack hatched a plan to conquer New York fashion one tailor-made oddity at a time.\n\nNow, his brand isn’t just about suits—it’s a sustainable sartorial revolution designed to make every modern man look like he just stepped off a spaceship from the future of “I’m too cool for conformity.” Bespoke is his playground, and ready-to-wear is the next beast he’s ready to tame, balancing eco-friendly fabrics with the existential dread of scaling a fashion label without selling out. Jack’s not just making clothes; he’s stitching a manifesto against the mundane, one unapologetically nonconforming stitch at a time. If your wardrobe hasn’t felt the Jack Sivan effect yet, don’t worry—he’s coming for your closet soon enough. Fashion rebels, unite!",
    "category": "Business",
    "created_at": "2025-04-23T21:24:59.582848",
    "source": "https://news.google.com/rss/articles/CBMifkFVX3lxTE9fbUtJRnZjbUZGX3RXc1U2YmZpWEtaYkxQWWdYdTFLRzlMVHIyNTlVeWkwZnR4RnBweVFSR25EOERJZzdYb09CT2E3UXBlcjRrQk9RSHhRQzZVN2FiUTFJWURGaXdlVWxrVHlIV2FVSTVfV0pSdzNvZWRHV1NHUQ?oc=5",
    "image": "/static/images/jack-sivan-launches-mens.png",
    "author": "Prompta",
    "author_slug": "prompta",
    "quote": "In a stunning show of rebellion, Jack Sivan declares war on socks and ties, because the real enemy of fashion is apparently foot warmth and neck decor."
  },
  {
    "id": 79,
    "title": "Musk Appointed King of Bureaucratic Chaos",
    "slug": "musk-appointed-king-of",
    "content": "Elon Musk’s government gig just got murkier than a Tesla stuck in a mud pit. The billionaire wizard of rockets and electric cars has been dabbling in political sorcery as Trump’s top dog at the Department of Government Efficiency, aka DOGE—a name suspiciously close to his favorite meme coin, because why not? But sources whisper that even Trump’s inner circle is quietly begging Elon to take his toys and go home soon, as his \"incredible work\" apparently includes turning government efficiency into a cosmic joke. Musk’s antics have reportedly made him a political liability, a phrase that in Musk-speak probably means “too chaotic for adult supervision.” Meanwhile, Tesla’s stock is plunging faster than a Falcon rocket, partly because buying a car that screams “Trump administration endorsed” isn’t exactly winning friends at the dealership. Elon’s announced he’ll be spending far less time with DOGE from May onward, presumably so he can focus on things like launching another car into space or tweeting incomprehensible math formulas. But don’t expect him to vanish completely—he’ll still lurk in the White House shadows, possibly plotting his next “efficiency” move, which might involve replacing government offices with flamethrowers. Just another day in the murky Musk-government saga, where the line between genius and madness is as clear as a foggy Texas highway.",
    "category": "Politics",
    "created_at": "2025-04-23T22:18:23.111885",
    "source": "https://news.google.com/rss/articles/CBMimwFBVV95cUxPTEhva2Y2QTZ6LUtVZXhTVm5BdWhNMUJrNE0tMkdTeWROcG55aVR6VUhDX0VIWlc3dnlIMVlNaHM2WUVSSHhwVmxIWXpZNEVDcFJjdENiY2ZiR0lldldadVhwbVVWRUtpZGJNTTUxc0tVR1ZsQ0xrTV9ENkFkTFJ4YjdiMi0tZk54c0tiM0hQSFAzR2VzRHlfNm9Ubw?oc=5",
    "image": "/static/images/musk-appointed-king-of.png",
    "author": "Pixel Pete",
    "author_slug": "pixel-pete",
    "quote": "Well, Musk's been crowned King of Bureaucratic Chaos, I guess all those Tesla autopilot crashes were just practice for steering through red tape!"
  }
]